stevenj/avr-libc3/include/avr/io/atmega406.h
/******************************************************************************
 *   This file is part of avr-libc3.                                          * 
 *                                                                            * 
 *   Automatically created by devtools/gen-ioheader-atdf.py (V0.91)           * 
 *                                                                            * 
 *   .atpack File: ATmega406.atdf                                             * 
 *   .ATDF File:   atdf/ATmega406.atdf                                        * 
 *   Version:      2.0.12                                                     * 
 *   Date:         2019-04-26                                                 * 
 *   Device:       ATmega406                                                  * 
 *   Architecture: AVR8                                                       * 
 *                                                                            * 
 *   Changelog:                                                               * 
 *                                                                            * 
 *   2.0.12 2019-04-26 :                                                      * 
 *        - Added missing registers and corrceted event generator list for    * 
 *        - mega4809/4808/3209/3208/1609/1608/809/808.                        * 
 *    2.0.2 2019-01-24 :                                                      * 
 *        - Succeeds Atmel.ATmega_DFP 1.3.300.                                * 
 *                                                                            * 
 *   Generated Source Derived from data:                                      * 
 *   Copyright (c) 2019 Microchip Technology Inc.                             * 
 *                                                                            * 
 *   Licensed under the Apache License, Version 2.0 (the "License");          * 
 *   you may not use this file except in compliance with the License.         * 
 *   You may obtain a copy of the Licence at                                  * 
 *                                                                            * 
 *       http://www.apache.org/licenses/LICENSE-2.0                           * 
 *                                                                            * 
 *   Unless required by applicable law or agreed to in writing, software      * 
 *   distributed under the License is distributed on an "AS IS" BASIS,        * 
 *   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. * 
 *   See the License for the specific language governing permissions and      * 
 *   limitations under the License.                                           * 
 ******************************************************************************/


#ifndef _AVR_IO_H_
#  error "Include <avr/io.h> instead of this file."
#endif

#ifndef _AVR_IOXXX_H_
#  define _AVR_IOXXX_H_ "ioATmega406.h"
#else
#  error "Attempt to include more than one <avr/ioXXX.h> file."
#endif

#ifndef _AVR_ATmega406_H_INCLUDED
#  define _AVR_ATmega406_H_INCLUDED

/*
================================================================================
Ungrouped common register
================================================================================
*/

#define GPIOR0  _SFR_MEM8 (0x3E) /* General Purpose IO Register 0 */

#define GPIOR1  _SFR_MEM8 (0x4A) /* General Purpose IO Register 1 */
#define GPIOR2  _SFR_MEM8 (0x4B) /* General Purpose IO Register 2 */

#define SMCR    _SFR_MEM8 (0x53) /* Sleep Mode Control Register */
#define MCUSR   _SFR_MEM8 (0x54) /* MCU Status Register */
#define MCUCR   _SFR_MEM8 (0x55) /* MCU Control Register */

#define SP      _SFR_MEM16(0x5D) /* Stack Pointer  */
#define SREG    _SFR_MEM8 (0x5F) /* Status Register */

#define PRR0    _SFR_MEM8 (0x64) /* Power Reduction Register 0 */

#define FOSCCAL _SFR_MEM8 (0x66) /* Fast Oscillator Calibration Value */

#define DIDR0   _SFR_MEM8 (0x7E) /* Digital Input Disable Register */

#define CCSR    _SFR_MEM8 (0xC0) /* Clock Control and Status Register */


/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C LANGUAGE - ONLY
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

#if !defined (__ASSEMBLER__)
/*
================================================================================
IO Module Structures
================================================================================
*/


/*
--------------------------------------------------------------------------------
FUSE - Fuses
--------------------------------------------------------------------------------
*/

typedef struct FUSE_struct
{
    register8_t LOW; 
    register8_t HIGH;
} FUSE_t;


/* On-Chip Debug Enabled */
typedef enum FUSE_OCDEN_enum
{
    FUSE_OCDEN_CLEAR_gc = (0x00), /* On-Chip Debug Enabled - CLEAR */
    FUSE_OCDEN_SET_gc   = (0x02), /* On-Chip Debug Enabled - SET */
} FUSE_OCDEN_t;

/* JTAG Interface Enabled */
typedef enum FUSE_JTAGEN_enum
{
    FUSE_JTAGEN_CLEAR_gc = (0x00), /* JTAG Interface Enabled - CLEAR */
    FUSE_JTAGEN_SET_gc   = (0x01), /* JTAG Interface Enabled - SET */
} FUSE_JTAGEN_t;

/* Watchdog timer always on */
typedef enum FUSE_WDTON_enum
{
    FUSE_WDTON_CLEAR_gc = (0x00), /* Watchdog timer always on - CLEAR */
    FUSE_WDTON_SET_gc   = (0x80), /* Watchdog timer always on - SET */
} FUSE_WDTON_t;

/* Preserve EEPROM through the Chip Erase cycle */
typedef enum FUSE_EESAVE_enum
{
    FUSE_EESAVE_CLEAR_gc = (0x00), /* Preserve EEPROM through the Chip Erase cycle - CLEAR */
    FUSE_EESAVE_SET_gc   = (0x40), /* Preserve EEPROM through the Chip Erase cycle - SET */
} FUSE_EESAVE_t;

/* Select boot size */
typedef enum FUSE_BOOTSZ_enum
{
    FUSE_BOOTSZ_256W_4F00_gc  = (0x03<<4), /* Boot Flash size=256 words Boot address=$4F00 */
    FUSE_BOOTSZ_512W_4E00_gc  = (0x02<<4), /* Boot Flash size=512 words Boot address=$4E00 */
    FUSE_BOOTSZ_1024W_4C00_gc = (0x01<<4), /* Boot Flash size=1024 words Boot address=$4C00 */
    FUSE_BOOTSZ_2048W_4800_gc = (0x00<<4), /* Boot Flash size=2048 words Boot address=$4800 */
} FUSE_BOOTSZ_t;

/* Boot Reset vector Enabled */
typedef enum FUSE_BOOTRST_enum
{
    FUSE_BOOTRST_CLEAR_gc = (0x00), /* Boot Reset vector Enabled - CLEAR */
    FUSE_BOOTRST_SET_gc   = (0x08), /* Boot Reset vector Enabled - SET */
} FUSE_BOOTRST_t;

/* Clock Selection */
typedef enum FUSE_SUT_CKSEL_enum
{
    FUSE_SUT_CKSEL_14CK_0MS_gc   = (0x00), /* Start-up time: 14 CK + 0 ms */
    FUSE_SUT_CKSEL_14CK_3MS9_gc  = (0x02), /* Start-up time: 14 CK + 3.9 ms */
    FUSE_SUT_CKSEL_14CK_62MS5_gc = (0x04), /* Start-up time: 14 CK + 62.5 ms */
    FUSE_SUT_CKSEL_14CK_0MS_gc   = (0x01), /* Start-up time: 14 CK + 0 ms */
    FUSE_SUT_CKSEL_14CK_3MS9_gc  = (0x03), /* Start-up time: 14 CK + 3.9 ms */
    FUSE_SUT_CKSEL_14CK_62MS5_gc = (0x05), /* Start-up time: 14 CK + 62.5 ms */
} FUSE_SUT_CKSEL_t;

