stevenj/avr-libc3/include/avr/io/atmega406.h
/* Timer/Counter Synchronization Mode */
typedef enum TC1_TSM_enum
{
    TC1_TSM_CLEAR_gc = (0x00), /* Timer/Counter Synchronization Mode - CLEAR */
    TC1_TSM_SET_gc   = (0x80), /* Timer/Counter Synchronization Mode - SET */
} TC1_TSM_t;

/* Prescaler Reset */
typedef enum TC1_PSRSYNC_enum
{
    TC1_PSRSYNC_CLEAR_gc = (0x00), /* Prescaler Reset - CLEAR */
    TC1_PSRSYNC_SET_gc   = (0x01), /* Prescaler Reset - SET */
} TC1_PSRSYNC_t;

/*
--------------------------------------------------------------------------------
WAKEUP_TIMER - Wakeup Timer
--------------------------------------------------------------------------------
*/

typedef struct WAKEUP_TIMER_struct
{
    register8_t rsv_0x00[98]; /* RESERVED REGISTER BLOCK */
    register8_t WUTCSR;       /* Wake-up Timer Control Register */
} WAKEUP_TIMER_t;


/* Wake-up Timer Interrupt Flag */
typedef enum WAKEUP_TIMER_WUTIF_enum
{
    WAKEUP_TIMER_WUTIF_CLEAR_gc = (0x00), /* Wake-up Timer Interrupt Flag - CLEAR */
    WAKEUP_TIMER_WUTIF_SET_gc   = (0x80), /* Wake-up Timer Interrupt Flag - SET */
} WAKEUP_TIMER_WUTIF_t;

/* Wake-up Timer Interrupt Enable */
typedef enum WAKEUP_TIMER_WUTIE_enum
{
    WAKEUP_TIMER_WUTIE_CLEAR_gc = (0x00), /* Wake-up Timer Interrupt Enable - CLEAR */
    WAKEUP_TIMER_WUTIE_SET_gc   = (0x40), /* Wake-up Timer Interrupt Enable - SET */
} WAKEUP_TIMER_WUTIE_t;

/* Wake-up timer Calibration Flag */
typedef enum WAKEUP_TIMER_WUTCF_enum
{
    WAKEUP_TIMER_WUTCF_CLEAR_gc = (0x00), /* Wake-up timer Calibration Flag - CLEAR */
    WAKEUP_TIMER_WUTCF_SET_gc   = (0x20), /* Wake-up timer Calibration Flag - SET */
} WAKEUP_TIMER_WUTCF_t;

/* Wake-up Timer Reset */
typedef enum WAKEUP_TIMER_WUTR_enum
{
    WAKEUP_TIMER_WUTR_CLEAR_gc = (0x00), /* Wake-up Timer Reset - CLEAR */
    WAKEUP_TIMER_WUTR_SET_gc   = (0x10), /* Wake-up Timer Reset - SET */
} WAKEUP_TIMER_WUTR_t;

/* Wake-up Timer Enable */
typedef enum WAKEUP_TIMER_WUTE_enum
{
    WAKEUP_TIMER_WUTE_CLEAR_gc = (0x00), /* Wake-up Timer Enable - CLEAR */
    WAKEUP_TIMER_WUTE_SET_gc   = (0x08), /* Wake-up Timer Enable - SET */
} WAKEUP_TIMER_WUTE_t;

/* Wake-up Timer Prescaler Bits */
typedef enum WAKEUP_TIMER_WUTP_enum
{
    WAKEUP_TIMER_WUTP_VAL_0x00_gc = (0x00), /* 4K(Slow RC) / 1K (32kHz) */
    WAKEUP_TIMER_WUTP_VAL_0x01_gc = (0x01), /* 8K(Slow RC) / 2K (32kHz) */
    WAKEUP_TIMER_WUTP_VAL_0x02_gc = (0x02), /* 16K(Slow RC) / 4K (32kHz) */
    WAKEUP_TIMER_WUTP_VAL_0x03_gc = (0x03), /* 32K(Slow RC) / 8K (32kHz) */
    WAKEUP_TIMER_WUTP_VAL_0x04_gc = (0x04), /* 64K(Slow RC) / 16K (32kHz) */
    WAKEUP_TIMER_WUTP_VAL_0x05_gc = (0x05), /* 128K(Slow RC) / 32K (32kHz) */
    WAKEUP_TIMER_WUTP_VAL_0x06_gc = (0x06), /* 256K(Slow RC) / 64K (32kHz) */
    WAKEUP_TIMER_WUTP_VAL_0x07_gc = (0x07), /* 512K(Slow RC) / 128K (32kHz) */
} WAKEUP_TIMER_WUTP_t;

/*
--------------------------------------------------------------------------------
BATTERY_PROTECTION - Battery Protection
--------------------------------------------------------------------------------
*/

typedef struct BATTERY_PROTECTION_struct
{
    register8_t rsv_0x00[242]; /* RESERVED REGISTER BLOCK */
    register8_t BPIR;          /* Battery Protection Interrupt Register */
    register8_t BPDUV;         /* Battery Protection Deep Under Voltage Register */
    register8_t BPSCD;         /* Battery Protection Short-Circuit Detection Level Register */
    register8_t BPOCD;         /* Battery Protection OverCurrent Detection Level Register */
    register8_t CBPTR;         /* Current Battery Protection Timing Register */
    register8_t BPCR;          /* Battery Protection Control Register */
    register8_t BPPLR;         /* Battery Protection Parameter Lock Register */
} BATTERY_PROTECTION_t;


/* Battery Protection Parameter Lock Enable */
typedef enum BATTERY_PROTECTION_BPPLE_enum
{
    BATTERY_PROTECTION_BPPLE_CLEAR_gc = (0x00), /* Battery Protection Parameter Lock Enable - CLEAR */
    BATTERY_PROTECTION_BPPLE_SET_gc   = (0x02), /* Battery Protection Parameter Lock Enable - SET */
} BATTERY_PROTECTION_BPPLE_t;

/* Battery Protection Parameter Lock */
typedef enum BATTERY_PROTECTION_BPPL_enum
{
    BATTERY_PROTECTION_BPPL_CLEAR_gc = (0x00), /* Battery Protection Parameter Lock - CLEAR */
    BATTERY_PROTECTION_BPPL_SET_gc   = (0x01), /* Battery Protection Parameter Lock - SET */
} BATTERY_PROTECTION_BPPL_t;

/* Battery Protection Control Register-DUVD */
typedef enum BATTERY_PROTECTION_DUVD_enum
{
    BATTERY_PROTECTION_DUVD_CLEAR_gc = (0x00), /* Battery Protection Control Register-DUVD - CLEAR */
    BATTERY_PROTECTION_DUVD_SET_gc   = (0x08), /* Battery Protection Control Register-DUVD - SET */
} BATTERY_PROTECTION_DUVD_t;

/* Battery Protection Control Register-SCD */
typedef enum BATTERY_PROTECTION_SCD_enum
{
    BATTERY_PROTECTION_SCD_CLEAR_gc = (0x00), /* Battery Protection Control Register-SCD - CLEAR */
    BATTERY_PROTECTION_SCD_SET_gc   = (0x04), /* Battery Protection Control Register-SCD - SET */
} BATTERY_PROTECTION_SCD_t;

/* Battery Protection Control Register-DCD */
typedef enum BATTERY_PROTECTION_DCD_enum
{
    BATTERY_PROTECTION_DCD_CLEAR_gc = (0x00), /* Battery Protection Control Register-DCD - CLEAR */
    BATTERY_PROTECTION_DCD_SET_gc   = (0x02), /* Battery Protection Control Register-DCD - SET */
} BATTERY_PROTECTION_DCD_t;

/* Battery Protection Control Register-CCD */
typedef enum BATTERY_PROTECTION_CCD_enum
{
    BATTERY_PROTECTION_CCD_CLEAR_gc = (0x00), /* Battery Protection Control Register-CCD - CLEAR */
    BATTERY_PROTECTION_CCD_SET_gc   = (0x01), /* Battery Protection Control Register-CCD - SET */
} BATTERY_PROTECTION_CCD_t;

/* Current Battery Protection Timing Register-SCPT */
typedef enum BATTERY_PROTECTION_SCPT_enum
{
    BATTERY_PROTECTION_SCPT_VAL_0x00_gc = (0x00<<4), /* 61 us */
    BATTERY_PROTECTION_SCPT_VAL_0x01_gc = (0x01<<4), /* 122 us */
    BATTERY_PROTECTION_SCPT_VAL_0x02_gc = (0x02<<4), /* 183 us */
    BATTERY_PROTECTION_SCPT_VAL_0x03_gc = (0x03<<4), /* 244 us */
    BATTERY_PROTECTION_SCPT_VAL_0x04_gc = (0x04<<4), /* 305 us */
    BATTERY_PROTECTION_SCPT_VAL_0x05_gc = (0x05<<4), /* 366 us */
    BATTERY_PROTECTION_SCPT_VAL_0x06_gc = (0x06<<4), /* 427 us */
    BATTERY_PROTECTION_SCPT_VAL_0x07_gc = (0x07<<4), /* 488 us */
    BATTERY_PROTECTION_SCPT_VAL_0x08_gc = (0x08<<4), /* 610 us */
    BATTERY_PROTECTION_SCPT_VAL_0x09_gc = (0x09<<4), /* 732 us */
    BATTERY_PROTECTION_SCPT_VAL_0x0A_gc = (0x0A<<4), /* 854 us */
    BATTERY_PROTECTION_SCPT_VAL_0x0B_gc = (0x0B<<4), /* 976 us */
    BATTERY_PROTECTION_SCPT_VAL_0x0C_gc = (0x0C<<4), /* 1098 us */
    BATTERY_PROTECTION_SCPT_VAL_0x0D_gc = (0x0D<<4), /* 1220 us */
    BATTERY_PROTECTION_SCPT_VAL_0x0E_gc = (0x0E<<4), /* 1342 us */
    BATTERY_PROTECTION_SCPT_VAL_0x0F_gc = (0x0F<<4), /* 1464 us */
} BATTERY_PROTECTION_SCPT_t;

/* Current Battery Protection Timing Register-OCPT */
typedef enum BATTERY_PROTECTION_OCPT_enum
{
    BATTERY_PROTECTION_OCPT_VAL_0x00_gc = (0x00), /* 1 ms */
    BATTERY_PROTECTION_OCPT_VAL_0x01_gc = (0x01), /* 2 ms */
    BATTERY_PROTECTION_OCPT_VAL_0x02_gc = (0x02), /* 4 ms */
    BATTERY_PROTECTION_OCPT_VAL_0x03_gc = (0x03), /* 6 ms */
    BATTERY_PROTECTION_OCPT_VAL_0x04_gc = (0x04), /* 8 ms */
    BATTERY_PROTECTION_OCPT_VAL_0x05_gc = (0x05), /* 10 ms */
    BATTERY_PROTECTION_OCPT_VAL_0x06_gc = (0x06), /* 12 ms */
    BATTERY_PROTECTION_OCPT_VAL_0x07_gc = (0x07), /* 14 ms */
    BATTERY_PROTECTION_OCPT_VAL_0x08_gc = (0x08), /* 16 ms */
    BATTERY_PROTECTION_OCPT_VAL_0x09_gc = (0x09), /* 18 ms */
    BATTERY_PROTECTION_OCPT_VAL_0x0A_gc = (0x0A), /* 20 ms */
    BATTERY_PROTECTION_OCPT_VAL_0x0B_gc = (0x0B), /* 22 ms */
    BATTERY_PROTECTION_OCPT_VAL_0x0C_gc = (0x0C), /* 24 ms */
    BATTERY_PROTECTION_OCPT_VAL_0x0D_gc = (0x0D), /* 26 ms */
    BATTERY_PROTECTION_OCPT_VAL_0x0E_gc = (0x0E), /* 28 ms */
    BATTERY_PROTECTION_OCPT_VAL_0x0F_gc = (0x0F), /* 30 ms */
} BATTERY_PROTECTION_OCPT_t;

/* Battery Protection OverCurrent Detection Level Register-DCDL */
typedef enum BATTERY_PROTECTION_DCDL_enum
{
    BATTERY_PROTECTION_DCDL_VAL_0x00_gc = (0x00<<4), /* 0.050V */
    BATTERY_PROTECTION_DCDL_VAL_0x01_gc = (0x01<<4), /* 0.055V */
    BATTERY_PROTECTION_DCDL_VAL_0x02_gc = (0x02<<4), /* 0.060V */
    BATTERY_PROTECTION_DCDL_VAL_0x03_gc = (0x03<<4), /* 0.065V */
    BATTERY_PROTECTION_DCDL_VAL_0x04_gc = (0x04<<4), /* 0.070V */
    BATTERY_PROTECTION_DCDL_VAL_0x05_gc = (0x05<<4), /* 0.080V */
    BATTERY_PROTECTION_DCDL_VAL_0x06_gc = (0x06<<4), /* 0.090V */
    BATTERY_PROTECTION_DCDL_VAL_0x07_gc = (0x07<<4), /* 0.100V */
    BATTERY_PROTECTION_DCDL_VAL_0x08_gc = (0x08<<4), /* 0.110V */
    BATTERY_PROTECTION_DCDL_VAL_0x09_gc = (0x09<<4), /* 0.120V */
    BATTERY_PROTECTION_DCDL_VAL_0x0A_gc = (0x0A<<4), /* 0.130V */
    BATTERY_PROTECTION_DCDL_VAL_0x0B_gc = (0x0B<<4), /* 0.140V */
    BATTERY_PROTECTION_DCDL_VAL_0x0C_gc = (0x0C<<4), /* 0.160V */
    BATTERY_PROTECTION_DCDL_VAL_0x0D_gc = (0x0D<<4), /* 0.180V */
    BATTERY_PROTECTION_DCDL_VAL_0x0E_gc = (0x0E<<4), /* 0.200V */
    BATTERY_PROTECTION_DCDL_VAL_0x0F_gc = (0x0F<<4), /* 0.220V */
} BATTERY_PROTECTION_DCDL_t;

/* Battery Protection OverCurrent Detection Level Register-CCDL */
typedef enum BATTERY_PROTECTION_CCDL_enum
{
    BATTERY_PROTECTION_CCDL_VAL_0x00_gc = (0x00), /* 0.050V */
    BATTERY_PROTECTION_CCDL_VAL_0x01_gc = (0x01), /* 0.055V */
    BATTERY_PROTECTION_CCDL_VAL_0x02_gc = (0x02), /* 0.060V */
    BATTERY_PROTECTION_CCDL_VAL_0x03_gc = (0x03), /* 0.065V */
    BATTERY_PROTECTION_CCDL_VAL_0x04_gc = (0x04), /* 0.070V */
    BATTERY_PROTECTION_CCDL_VAL_0x05_gc = (0x05), /* 0.080V */
    BATTERY_PROTECTION_CCDL_VAL_0x06_gc = (0x06), /* 0.090V */
    BATTERY_PROTECTION_CCDL_VAL_0x07_gc = (0x07), /* 0.100V */
    BATTERY_PROTECTION_CCDL_VAL_0x08_gc = (0x08), /* 0.110V */
    BATTERY_PROTECTION_CCDL_VAL_0x09_gc = (0x09), /* 0.120V */
    BATTERY_PROTECTION_CCDL_VAL_0x0A_gc = (0x0A), /* 0.130V */
    BATTERY_PROTECTION_CCDL_VAL_0x0B_gc = (0x0B), /* 0.140V */
    BATTERY_PROTECTION_CCDL_VAL_0x0C_gc = (0x0C), /* 0.160V */
    BATTERY_PROTECTION_CCDL_VAL_0x0D_gc = (0x0D), /* 0.180V */
    BATTERY_PROTECTION_CCDL_VAL_0x0E_gc = (0x0E), /* 0.200V */
    BATTERY_PROTECTION_CCDL_VAL_0x0F_gc = (0x0F), /* 0.220V */
} BATTERY_PROTECTION_CCDL_t;

/* Battery Protection Short-Circuit Detection Level Register-SCDL */
typedef enum BATTERY_PROTECTION_SCDL_enum
{
    BATTERY_PROTECTION_SCDL_VAL_0x00_gc = (0x00), /* 0.100V */
    BATTERY_PROTECTION_SCDL_VAL_0x01_gc = (0x01), /* 0.110V */
    BATTERY_PROTECTION_SCDL_VAL_0x02_gc = (0x02), /* 0.120V */
    BATTERY_PROTECTION_SCDL_VAL_0x03_gc = (0x03), /* 0.130V */
    BATTERY_PROTECTION_SCDL_VAL_0x04_gc = (0x04), /* 0.140V */
    BATTERY_PROTECTION_SCDL_VAL_0x05_gc = (0x05), /* 0.160V */
    BATTERY_PROTECTION_SCDL_VAL_0x06_gc = (0x06), /* 0.180V */
    BATTERY_PROTECTION_SCDL_VAL_0x07_gc = (0x07), /* 0.200V */
    BATTERY_PROTECTION_SCDL_VAL_0x08_gc = (0x08), /* 0.220V */
    BATTERY_PROTECTION_SCDL_VAL_0x09_gc = (0x09), /* 0.240V */
    BATTERY_PROTECTION_SCDL_VAL_0x0A_gc = (0x0A), /* 0.260V */
    BATTERY_PROTECTION_SCDL_VAL_0x0B_gc = (0x0B), /* 0.280V */
    BATTERY_PROTECTION_SCDL_VAL_0x0C_gc = (0x0C), /* 0.320V */
    BATTERY_PROTECTION_SCDL_VAL_0x0D_gc = (0x0D), /* 0.360V */
    BATTERY_PROTECTION_SCDL_VAL_0x0E_gc = (0x0E), /* 0.400V */
    BATTERY_PROTECTION_SCDL_VAL_0x0F_gc = (0x0F), /* 0.440V */
} BATTERY_PROTECTION_SCDL_t;

/* Battery Protection Deep Under Voltage Register-DUVT */
typedef enum BATTERY_PROTECTION_DUVT_enum
{
    BATTERY_PROTECTION_DUVT_VAL_0x00_gc = (0x00<<4), /* 750ms */
    BATTERY_PROTECTION_DUVT_VAL_0x01_gc = (0x01<<4), /* 1000ms */
    BATTERY_PROTECTION_DUVT_VAL_0x02_gc = (0x02<<4), /* 1250ms */
    BATTERY_PROTECTION_DUVT_VAL_0x03_gc = (0x03<<4), /* 1500ms */
} BATTERY_PROTECTION_DUVT_t;

/* Battery Protection Deep Under Voltage Register-DUDL */
typedef enum BATTERY_PROTECTION_DUDL_enum
{
    BATTERY_PROTECTION_DUDL_VAL_0x00_gc = (0x00), /* 4.71V */
    BATTERY_PROTECTION_DUDL_VAL_0x01_gc = (0x01), /* 5.03V */
    BATTERY_PROTECTION_DUDL_VAL_0x02_gc = (0x02), /* 5.34V */
    BATTERY_PROTECTION_DUDL_VAL_0x03_gc = (0x03), /* 5.66V */
    BATTERY_PROTECTION_DUDL_VAL_0x04_gc = (0x04), /* 5.97V */
    BATTERY_PROTECTION_DUDL_VAL_0x05_gc = (0x05), /* 6.29V */
    BATTERY_PROTECTION_DUDL_VAL_0x06_gc = (0x06), /* 6.60V */
    BATTERY_PROTECTION_DUDL_VAL_0x07_gc = (0x07), /* 6.91V */
    BATTERY_PROTECTION_DUDL_VAL_0x08_gc = (0x08), /* 7.23V */
    BATTERY_PROTECTION_DUDL_VAL_0x09_gc = (0x09), /* 7.54V */
    BATTERY_PROTECTION_DUDL_VAL_0x0A_gc = (0x0A), /* 7.86V */
    BATTERY_PROTECTION_DUDL_VAL_0x0B_gc = (0x0B), /* 8.17V */
    BATTERY_PROTECTION_DUDL_VAL_0x0C_gc = (0x0C), /* 8.49V */
    BATTERY_PROTECTION_DUDL_VAL_0x0D_gc = (0x0D), /* 8.80V */
    BATTERY_PROTECTION_DUDL_VAL_0x0E_gc = (0x0E), /* 9.11V */
    BATTERY_PROTECTION_DUDL_VAL_0x0F_gc = (0x0F), /* 9.43V */
} BATTERY_PROTECTION_DUDL_t;

/* Deep Under-voltage Early Warning Interrupt Flag */
typedef enum BATTERY_PROTECTION_DUVIF_enum
{
    BATTERY_PROTECTION_DUVIF_CLEAR_gc = (0x00), /* Deep Under-voltage Early Warning Interrupt Flag - CLEAR */
    BATTERY_PROTECTION_DUVIF_SET_gc   = (0x80), /* Deep Under-voltage Early Warning Interrupt Flag - SET */
} BATTERY_PROTECTION_DUVIF_t;

/* Charge Over-current Protection Activated Interrupt Flag */
typedef enum BATTERY_PROTECTION_COCIF_enum
{
    BATTERY_PROTECTION_COCIF_CLEAR_gc = (0x00), /* Charge Over-current Protection Activated Interrupt Flag - CLEAR */
    BATTERY_PROTECTION_COCIF_SET_gc   = (0x40), /* Charge Over-current Protection Activated Interrupt Flag - SET */
} BATTERY_PROTECTION_COCIF_t;

/* Battery Protection Interrupt Register-DOCIF */
typedef enum BATTERY_PROTECTION_DOCIF_enum
{
    BATTERY_PROTECTION_DOCIF_CLEAR_gc = (0x00), /* Battery Protection Interrupt Register-DOCIF - CLEAR */
    BATTERY_PROTECTION_DOCIF_SET_gc   = (0x20), /* Battery Protection Interrupt Register-DOCIF - SET */
} BATTERY_PROTECTION_DOCIF_t;

