stevenj/avr-libc3/include/avr/io/atmega406.h
/* Battery Protection Interrupt Register-SCIF */
typedef enum BATTERY_PROTECTION_SCIF_enum
{
    BATTERY_PROTECTION_SCIF_CLEAR_gc = (0x00), /* Battery Protection Interrupt Register-SCIF - CLEAR */
    BATTERY_PROTECTION_SCIF_SET_gc   = (0x10), /* Battery Protection Interrupt Register-SCIF - SET */
} BATTERY_PROTECTION_SCIF_t;

/* Deep Under-voltage Early Warning Interrupt Enable */
typedef enum BATTERY_PROTECTION_DUVIE_enum
{
    BATTERY_PROTECTION_DUVIE_CLEAR_gc = (0x00), /* Deep Under-voltage Early Warning Interrupt Enable - CLEAR */
    BATTERY_PROTECTION_DUVIE_SET_gc   = (0x08), /* Deep Under-voltage Early Warning Interrupt Enable - SET */
} BATTERY_PROTECTION_DUVIE_t;

/* Battery Protection Interrupt Register-COCIE */
typedef enum BATTERY_PROTECTION_COCIE_enum
{
    BATTERY_PROTECTION_COCIE_CLEAR_gc = (0x00), /* Battery Protection Interrupt Register-COCIE - CLEAR */
    BATTERY_PROTECTION_COCIE_SET_gc   = (0x04), /* Battery Protection Interrupt Register-COCIE - SET */
} BATTERY_PROTECTION_COCIE_t;

/* Battery Protection Interrupt Register-DOCIE */
typedef enum BATTERY_PROTECTION_DOCIE_enum
{
    BATTERY_PROTECTION_DOCIE_CLEAR_gc = (0x00), /* Battery Protection Interrupt Register-DOCIE - CLEAR */
    BATTERY_PROTECTION_DOCIE_SET_gc   = (0x02), /* Battery Protection Interrupt Register-DOCIE - SET */
} BATTERY_PROTECTION_DOCIE_t;

/* Battery Protection Interrupt Register-SCIE */
typedef enum BATTERY_PROTECTION_SCIE_enum
{
    BATTERY_PROTECTION_SCIE_CLEAR_gc = (0x00), /* Battery Protection Interrupt Register-SCIE - CLEAR */
    BATTERY_PROTECTION_SCIE_SET_gc   = (0x01), /* Battery Protection Interrupt Register-SCIE - SET */
} BATTERY_PROTECTION_SCIE_t;

/*
--------------------------------------------------------------------------------
FET - FET Control
--------------------------------------------------------------------------------
*/

typedef struct FET_struct
{
    register8_t rsv_0x00[240]; /* RESERVED REGISTER BLOCK */
    register8_t FCSR;         
} FET_t;


/* Pulse Width Modulation of OC output */
typedef enum FET_PWMOC_enum
{
    FET_PWMOC_CLEAR_gc = (0x00), /* Pulse Width Modulation of OC output - CLEAR */
    FET_PWMOC_SET_gc   = (0x20), /* Pulse Width Modulation of OC output - SET */
} FET_PWMOC_t;

/* Pulse Width Modulation Modulation of OPC output */
typedef enum FET_PWMOPC_enum
{
    FET_PWMOPC_CLEAR_gc = (0x00), /* Pulse Width Modulation Modulation of OPC output - CLEAR */
    FET_PWMOPC_SET_gc   = (0x10), /* Pulse Width Modulation Modulation of OPC output - SET */
} FET_PWMOPC_t;

/* Current Protection Status */
typedef enum FET_CPS_enum
{
    FET_CPS_CLEAR_gc = (0x00), /* Current Protection Status - CLEAR */
    FET_CPS_SET_gc   = (0x08), /* Current Protection Status - SET */
} FET_CPS_t;

/* Discharge FET Enable */
typedef enum FET_DFE_enum
{
    FET_DFE_CLEAR_gc = (0x00), /* Discharge FET Enable - CLEAR */
    FET_DFE_SET_gc   = (0x04), /* Discharge FET Enable - SET */
} FET_DFE_t;

/* Charge FET Enable */
typedef enum FET_CFE_enum
{
    FET_CFE_CLEAR_gc = (0x00), /* Charge FET Enable - CLEAR */
    FET_CFE_SET_gc   = (0x02), /* Charge FET Enable - SET */
} FET_CFE_t;

/* Precharge FET disable */
typedef enum FET_PFD_enum
{
    FET_PFD_CLEAR_gc = (0x00), /* Precharge FET disable - CLEAR */
    FET_PFD_SET_gc   = (0x01), /* Precharge FET disable - SET */
} FET_PFD_t;

/*
--------------------------------------------------------------------------------
COULOMB_COUNTER - Coulomb Counter
--------------------------------------------------------------------------------
*/

typedef struct COULOMB_COUNTER_struct
{
    register8_t rsv_0x00[224]; /* RESERVED REGISTER BLOCK */
    register8_t CADAC0;        /* ADC Accumulate Current */
    register8_t CADAC1;        /* ADC Accumulate Current */
    register8_t CADAC2;        /* ADC Accumulate Current */
    register8_t CADAC3;        /* ADC Accumulate Current */
    register8_t CADCSRA;       /* CC-ADC Control and Status Register A */
    register8_t CADCSRB;       /* CC-ADC Control and Status Register B */
    register8_t CADRCC;        /* CC-ADC Regular Charge Current */
    register8_t CADRDC;        /* CC-ADC Regular Discharge Current */
    _REGISTER16 (CADIC);       /* CC-ADC Instantaneous Current */
} COULOMB_COUNTER_t;


/* When the CADEN bit is cleared (zero), the CC-ADC is disabled. When the CADEN bit is set (one), the CC-ADC will continuously measure the voltage drop over the external sense resistor RSENSE. In Power-down, only the Regular Current detection is active. In Power-off, the CC-ADC is always disabled. */
typedef enum COULOMB_COUNTER_CADEN_enum
{
    COULOMB_COUNTER_CADEN_CLEAR_gc = (0x00), /* When the CADEN bit is cleared (zero), the CC-ADC is disabled. When the CADEN bit is set (one), the CC-ADC will continuously measure the voltage drop over the external sense resistor RSENSE. In Power-down, only the Regular Current detection is active. In Power-off, the CC-ADC is always disabled. - CLEAR */
    COULOMB_COUNTER_CADEN_SET_gc   = (0x80), /* When the CADEN bit is cleared (zero), the CC-ADC is disabled. When the CADEN bit is set (one), the CC-ADC will continuously measure the voltage drop over the external sense resistor RSENSE. In Power-down, only the Regular Current detection is active. In Power-off, the CC-ADC is always disabled. - SET */
} COULOMB_COUNTER_CADEN_t;

/* CC_ADC Update Busy */
typedef enum COULOMB_COUNTER_CADUB_enum
{
    COULOMB_COUNTER_CADUB_CLEAR_gc = (0x00), /* CC_ADC Update Busy - CLEAR */
    COULOMB_COUNTER_CADUB_SET_gc   = (0x20), /* CC_ADC Update Busy - SET */
} COULOMB_COUNTER_CADUB_t;

/* CC_ADC Accumulate Current Select Bits */
typedef enum COULOMB_COUNTER_CADAS_enum
{
    COULOMB_COUNTER_CADAS_VAL_0x00_gc = (0x00<<3), /* 125ms */
    COULOMB_COUNTER_CADAS_VAL_0x01_gc = (0x01<<3), /* 250ms */
    COULOMB_COUNTER_CADAS_VAL_0x02_gc = (0x02<<3), /* 500ms */
    COULOMB_COUNTER_CADAS_VAL_0x03_gc = (0x03<<3), /* 1000ms */
} COULOMB_COUNTER_CADAS_t;

/* The CADSI bits determine the current sampling interval for the Regular Current detection in Power-down mode. The actual settings remain to be determined. */
typedef enum COULOMB_COUNTER_CADSI_enum
{
    COULOMB_COUNTER_CADSI_VAL_0x00_gc = (0x00<<1), /* 125ms */
    COULOMB_COUNTER_CADSI_VAL_0x01_gc = (0x01<<1), /* 250ms */
    COULOMB_COUNTER_CADSI_VAL_0x02_gc = (0x02<<1), /* 500ms */
    COULOMB_COUNTER_CADSI_VAL_0x03_gc = (0x03<<1), /* 1000ms */
} COULOMB_COUNTER_CADSI_t;

/* When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode. */
typedef enum COULOMB_COUNTER_CADSE_enum
{
    COULOMB_COUNTER_CADSE_CLEAR_gc = (0x00), /* When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode. - CLEAR */
    COULOMB_COUNTER_CADSE_SET_gc   = (0x01), /* When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode. - SET */
} COULOMB_COUNTER_CADSE_t;

