stevenj/avr-libc3/include/avr/io/atmega406.h
/* CC-ADC Control and Status Register B-CADACIE */
typedef enum COULOMB_COUNTER_CADACIE_enum
{
    COULOMB_COUNTER_CADACIE_CLEAR_gc = (0x00), /* CC-ADC Control and Status Register B-CADACIE - CLEAR */
    COULOMB_COUNTER_CADACIE_SET_gc   = (0x40), /* CC-ADC Control and Status Register B-CADACIE - SET */
} COULOMB_COUNTER_CADACIE_t;

/* Regular Current Interrupt Enable */
typedef enum COULOMB_COUNTER_CADRCIE_enum
{
    COULOMB_COUNTER_CADRCIE_CLEAR_gc = (0x00), /* Regular Current Interrupt Enable - CLEAR */
    COULOMB_COUNTER_CADRCIE_SET_gc   = (0x20), /* Regular Current Interrupt Enable - SET */
} COULOMB_COUNTER_CADRCIE_t;

/* CAD Instantenous Current Interrupt Enable */
typedef enum COULOMB_COUNTER_CADICIE_enum
{
    COULOMB_COUNTER_CADICIE_CLEAR_gc = (0x00), /* CAD Instantenous Current Interrupt Enable - CLEAR */
    COULOMB_COUNTER_CADICIE_SET_gc   = (0x10), /* CAD Instantenous Current Interrupt Enable - SET */
} COULOMB_COUNTER_CADICIE_t;

/* CC-ADC Accumulate Current Interrupt Flag */
typedef enum COULOMB_COUNTER_CADACIF_enum
{
    COULOMB_COUNTER_CADACIF_CLEAR_gc = (0x00), /* CC-ADC Accumulate Current Interrupt Flag - CLEAR */
    COULOMB_COUNTER_CADACIF_SET_gc   = (0x04), /* CC-ADC Accumulate Current Interrupt Flag - SET */
} COULOMB_COUNTER_CADACIF_t;

/* CC-ADC Accumulate Current Interrupt Flag */
typedef enum COULOMB_COUNTER_CADRCIF_enum
{
    COULOMB_COUNTER_CADRCIF_CLEAR_gc = (0x00), /* CC-ADC Accumulate Current Interrupt Flag - CLEAR */
    COULOMB_COUNTER_CADRCIF_SET_gc   = (0x02), /* CC-ADC Accumulate Current Interrupt Flag - SET */
} COULOMB_COUNTER_CADRCIF_t;

/* CC-ADC Instantaneous Current Interrupt Flag */
typedef enum COULOMB_COUNTER_CADICIF_enum
{
    COULOMB_COUNTER_CADICIF_CLEAR_gc = (0x00), /* CC-ADC Instantaneous Current Interrupt Flag - CLEAR */
    COULOMB_COUNTER_CADICIF_SET_gc   = (0x01), /* CC-ADC Instantaneous Current Interrupt Flag - SET */
} COULOMB_COUNTER_CADICIF_t;

/*
--------------------------------------------------------------------------------
CELL_BALANCING - Cell Balancing
--------------------------------------------------------------------------------
*/

typedef struct CELL_BALANCING_struct
{
    register8_t rsv_0x00[241]; /* RESERVED REGISTER BLOCK */
    register8_t CBCR;          /* Cell Balancing Control Register */
} CELL_BALANCING_t;


/*
--------------------------------------------------------------------------------
CPU - CPU Registers
--------------------------------------------------------------------------------
*/

typedef struct CPU_struct
{
    register8_t rsv_0x00[62]; /* RESERVED REGISTER BLOCK */
    register8_t GPIOR0;       /* General Purpose IO Register 0 */
    register8_t rsv_0x3F[11]; /* RESERVED REGISTER BLOCK */
    register8_t GPIOR1;       /* General Purpose IO Register 1 */
    register8_t GPIOR2;       /* General Purpose IO Register 2 */
    register8_t rsv_0x4C[7];  /* RESERVED REGISTER BLOCK */
    register8_t SMCR;         /* Sleep Mode Control Register */
    register8_t MCUSR;        /* MCU Status Register */
    register8_t MCUCR;        /* MCU Control Register */
    register8_t rsv_0x56[7];  /* RESERVED REGISTER BLOCK */
    _REGISTER16 (SP);         /* Stack Pointer  */
    register8_t rsv_0x5E;     /* RESERVED REGISTER */
    register8_t SREG;         /* Status Register */
    register8_t rsv_0x60[4];  /* RESERVED REGISTER BLOCK */
    register8_t PRR0;         /* Power Reduction Register 0 */
    register8_t rsv_0x65;     /* RESERVED REGISTER */
    register8_t FOSCCAL;      /* Fast Oscillator Calibration Value */
    register8_t rsv_0x67[23]; /* RESERVED REGISTER BLOCK */
    register8_t DIDR0;        /* Digital Input Disable Register */
    register8_t rsv_0x7F[65]; /* RESERVED REGISTER BLOCK */
    register8_t CCSR;         /* Clock Control and Status Register */
} CPU_t;


/* Global Interrupt Enable */
typedef enum CPU_I_enum
{
    CPU_I_CLEAR_gc = (0x00), /* Global Interrupt Enable - CLEAR */
    CPU_I_SET_gc   = (0x80), /* Global Interrupt Enable - SET */
} CPU_I_t;

/* Bit Copy Storage */
typedef enum CPU_T_enum
{
    CPU_T_CLEAR_gc = (0x00), /* Bit Copy Storage - CLEAR */
    CPU_T_SET_gc   = (0x40), /* Bit Copy Storage - SET */
} CPU_T_t;

/* Half Carry Flag */
typedef enum CPU_H_enum
{
    CPU_H_CLEAR_gc = (0x00), /* Half Carry Flag - CLEAR */
    CPU_H_SET_gc   = (0x20), /* Half Carry Flag - SET */
} CPU_H_t;

/* Sign Bit */
typedef enum CPU_S_enum
{
    CPU_S_CLEAR_gc = (0x00), /* Sign Bit - CLEAR */
    CPU_S_SET_gc   = (0x10), /* Sign Bit - SET */
} CPU_S_t;

/* Two's Complement Overflow Flag */
typedef enum CPU_V_enum
{
    CPU_V_CLEAR_gc = (0x00), /* Two's Complement Overflow Flag - CLEAR */
    CPU_V_SET_gc   = (0x08), /* Two's Complement Overflow Flag - SET */
} CPU_V_t;

/* Negative Flag */
typedef enum CPU_N_enum
{
    CPU_N_CLEAR_gc = (0x00), /* Negative Flag - CLEAR */
    CPU_N_SET_gc   = (0x04), /* Negative Flag - SET */
} CPU_N_t;

/* Zero Flag */
typedef enum CPU_Z_enum
{
    CPU_Z_CLEAR_gc = (0x00), /* Zero Flag - CLEAR */
    CPU_Z_SET_gc   = (0x02), /* Zero Flag - SET */
} CPU_Z_t;

/* Carry Flag */
typedef enum CPU_C_enum
{
    CPU_C_CLEAR_gc = (0x00), /* Carry Flag - CLEAR */
    CPU_C_SET_gc   = (0x01), /* Carry Flag - SET */
} CPU_C_t;

/* JTAG Disable */
typedef enum CPU_JTD_enum
{
    CPU_JTD_CLEAR_gc = (0x00), /* JTAG Disable - CLEAR */
    CPU_JTD_SET_gc   = (0x80), /* JTAG Disable - SET */
} CPU_JTD_t;

/* Pull-up disable */
typedef enum CPU_PUD_enum
{
    CPU_PUD_CLEAR_gc = (0x00), /* Pull-up disable - CLEAR */
    CPU_PUD_SET_gc   = (0x10), /* Pull-up disable - SET */
} CPU_PUD_t;

/* Interrupt Vector Select */
typedef enum CPU_IVSEL_enum
{
    CPU_IVSEL_CLEAR_gc = (0x00), /* Interrupt Vector Select - CLEAR */
    CPU_IVSEL_SET_gc   = (0x02), /* Interrupt Vector Select - SET */
} CPU_IVSEL_t;

/* Interrupt Vector Change Enable */
typedef enum CPU_IVCE_enum
{
    CPU_IVCE_CLEAR_gc = (0x00), /* Interrupt Vector Change Enable - CLEAR */
    CPU_IVCE_SET_gc   = (0x01), /* Interrupt Vector Change Enable - SET */
} CPU_IVCE_t;

/* JTAG Reset Flag */
typedef enum CPU_JTRF_enum
{
    CPU_JTRF_CLEAR_gc = (0x00), /* JTAG Reset Flag - CLEAR */
    CPU_JTRF_SET_gc   = (0x10), /* JTAG Reset Flag - SET */
} CPU_JTRF_t;

