stevenj/avr-libc3/include/avr/io/atmega406.h
/*
--------------------------------------------------------------------------------
FUSE - Fuses
--------------------------------------------------------------------------------
*/


/* On-Chip Debug Enabled */
#define FUSE_OCDEN_CLEAR_gc (0x00) /* On-Chip Debug Enabled - CLEAR */
#define FUSE_OCDEN_SET_gc   (0x02) /* On-Chip Debug Enabled - SET */


/* JTAG Interface Enabled */
#define FUSE_JTAGEN_CLEAR_gc (0x00) /* JTAG Interface Enabled - CLEAR */
#define FUSE_JTAGEN_SET_gc   (0x01) /* JTAG Interface Enabled - SET */


/* Watchdog timer always on */
#define FUSE_WDTON_CLEAR_gc (0x00) /* Watchdog timer always on - CLEAR */
#define FUSE_WDTON_SET_gc   (0x80) /* Watchdog timer always on - SET */


/* Preserve EEPROM through the Chip Erase cycle */
#define FUSE_EESAVE_CLEAR_gc (0x00) /* Preserve EEPROM through the Chip Erase cycle - CLEAR */
#define FUSE_EESAVE_SET_gc   (0x40) /* Preserve EEPROM through the Chip Erase cycle - SET */


/* Select boot size */
#define FUSE_BOOTSZ_256W_4F00_gc  (0x03<<4) /* Boot Flash size=256 words Boot address=$4F00 */
#define FUSE_BOOTSZ_512W_4E00_gc  (0x02<<4) /* Boot Flash size=512 words Boot address=$4E00 */
#define FUSE_BOOTSZ_1024W_4C00_gc (0x01<<4) /* Boot Flash size=1024 words Boot address=$4C00 */
#define FUSE_BOOTSZ_2048W_4800_gc (0x00<<4) /* Boot Flash size=2048 words Boot address=$4800 */


/* Boot Reset vector Enabled */
#define FUSE_BOOTRST_CLEAR_gc (0x00) /* Boot Reset vector Enabled - CLEAR */
#define FUSE_BOOTRST_SET_gc   (0x08) /* Boot Reset vector Enabled - SET */


/* Clock Selection */
#define FUSE_SUT_CKSEL_14CK_0MS_gc   (0x00) /* Start-up time: 14 CK + 0 ms */
#define FUSE_SUT_CKSEL_14CK_3MS9_gc  (0x02) /* Start-up time: 14 CK + 3.9 ms */
#define FUSE_SUT_CKSEL_14CK_62MS5_gc (0x04) /* Start-up time: 14 CK + 62.5 ms */
/* WARNING: FUSE_SUT_CKSEL_14CK_0MS_gc ALREADY DEFINED as '(0x00)' NOT '(0x01)' */
/* WARNING: FUSE_SUT_CKSEL_14CK_3MS9_gc ALREADY DEFINED as '(0x02)' NOT '(0x03)' */
/* WARNING: FUSE_SUT_CKSEL_14CK_62MS5_gc ALREADY DEFINED as '(0x04)' NOT '(0x05)' */


/*
--------------------------------------------------------------------------------
LOCKBIT - Lockbits
--------------------------------------------------------------------------------
*/


/* Memory Lock */
#define LOCKBIT_LB_PROG_VER_DISABLED_gc (0x00) /* Further programming and verification disabled */
#define LOCKBIT_LB_PROG_DISABLED_gc     (0x02) /* Further programming disabled */
#define LOCKBIT_LB_NO_LOCK_gc           (0x03) /* No memory lock features enabled */


/* Boot Loader Protection Mode */
#define LOCKBIT_BLB0_LPM_SPM_DISABLE_gc (0x00<<2) /* LPM and SPM prohibited in Application Section */
#define LOCKBIT_BLB0_LPM_DISABLE_gc     (0x01<<2) /* LPM prohibited in Application Section */
#define LOCKBIT_BLB0_SPM_DISABLE_gc     (0x02<<2) /* SPM prohibited in Application Section */
#define LOCKBIT_BLB0_NO_LOCK_gc         (0x03<<2) /* No lock on SPM and LPM in Application Section */


/* Boot Loader Protection Mode */
#define LOCKBIT_BLB1_LPM_SPM_DISABLE_gc (0x00<<4) /* LPM and SPM prohibited in Boot Section */
#define LOCKBIT_BLB1_LPM_DISABLE_gc     (0x01<<4) /* LPM prohibited in Boot Section */
#define LOCKBIT_BLB1_SPM_DISABLE_gc     (0x02<<4) /* SPM prohibited in Boot Section */
#define LOCKBIT_BLB1_NO_LOCK_gc         (0x03<<4) /* No lock on SPM and LPM in Boot Section */


/*
--------------------------------------------------------------------------------
ADC - Analog-to-Digital Converter
--------------------------------------------------------------------------------
*/


/* VADC Enable */
#define ADC_VADEN_CLEAR_gc (0x00) /* VADC Enable - CLEAR */
#define ADC_VADEN_SET_gc   (0x08) /* VADC Enable - SET */


/* VADC Satrt Conversion */
#define ADC_VADSC_CLEAR_gc (0x00) /* VADC Satrt Conversion - CLEAR */
#define ADC_VADSC_SET_gc   (0x04) /* VADC Satrt Conversion - SET */


/* VADC Conversion Complete Interrupt Flag */
#define ADC_VADCCIF_CLEAR_gc (0x00) /* VADC Conversion Complete Interrupt Flag - CLEAR */
#define ADC_VADCCIF_SET_gc   (0x02) /* VADC Conversion Complete Interrupt Flag - SET */


/* VADC Conversion Complete Interrupt Enable */
#define ADC_VADCCIE_CLEAR_gc (0x00) /* VADC Conversion Complete Interrupt Enable - CLEAR */
#define ADC_VADCCIE_SET_gc   (0x01) /* VADC Conversion Complete Interrupt Enable - SET */


/*
--------------------------------------------------------------------------------
EXINT - External Interrupts
--------------------------------------------------------------------------------
*/


/* External Interrupt Sense Control 3 Bits */
#define EXINT_ISC3_VAL_0x00_gc (0x00<<6) /* Low Level of INTX */
#define EXINT_ISC3_VAL_0x01_gc (0x01<<6) /* Any Logical Change of INTX */
#define EXINT_ISC3_VAL_0x02_gc (0x02<<6) /* Falling Edge of INTX */
#define EXINT_ISC3_VAL_0x03_gc (0x03<<6) /* Rising Edge of INTX */


/* External Interrupt Sense Control 2 Bits */
#define EXINT_ISC2_VAL_0x00_gc (0x00<<4) /* Low Level of INTX */
#define EXINT_ISC2_VAL_0x01_gc (0x01<<4) /* Any Logical Change of INTX */
#define EXINT_ISC2_VAL_0x02_gc (0x02<<4) /* Falling Edge of INTX */
#define EXINT_ISC2_VAL_0x03_gc (0x03<<4) /* Rising Edge of INTX */


/* External Interrupt Sense Control 1 Bits */
#define EXINT_ISC1_VAL_0x00_gc (0x00<<2) /* Low Level of INTX */
#define EXINT_ISC1_VAL_0x01_gc (0x01<<2) /* Any Logical Change of INTX */
#define EXINT_ISC1_VAL_0x02_gc (0x02<<2) /* Falling Edge of INTX */
#define EXINT_ISC1_VAL_0x03_gc (0x03<<2) /* Rising Edge of INTX */


/* External Interrupt Sense Control 0 Bits */
#define EXINT_ISC0_VAL_0x00_gc (0x00) /* Low Level of INTX */
#define EXINT_ISC0_VAL_0x01_gc (0x01) /* Any Logical Change of INTX */
#define EXINT_ISC0_VAL_0x02_gc (0x02) /* Falling Edge of INTX */
#define EXINT_ISC0_VAL_0x03_gc (0x03) /* Rising Edge of INTX */


/*
--------------------------------------------------------------------------------
TC16 - Timer/Counter, 16-bit
--------------------------------------------------------------------------------
*/


/* Clear Timer/Counter on Compare Match */
#define TC1_CTC1_CLEAR_gc (0x00) /* Clear Timer/Counter on Compare Match - CLEAR */
#define TC1_CTC1_SET_gc   (0x08) /* Clear Timer/Counter on Compare Match - SET */


/* Clock Select1 bits */
#define TC1_CS1_VAL_0x00_gc (0x00) /* No Clock Source (Stopped) */
#define TC1_CS1_VAL_0x01_gc (0x01) /* Running, No Prescaling */
#define TC1_CS1_VAL_0x02_gc (0x02) /* Running, CLK/8 */
#define TC1_CS1_VAL_0x03_gc (0x03) /* Running, CLK/32 */
#define TC1_CS1_VAL_0x04_gc (0x04) /* Running, CLK/64 */
#define TC1_CS1_VAL_0x05_gc (0x05) /* Running, CLK/128 */
#define TC1_CS1_VAL_0x06_gc (0x06) /* Running, CLK/256 */
#define TC1_CS1_VAL_0x07_gc (0x07) /* Running, CLK/1024 */


/* Timer/Counter1 Output Compare Interrupt Enable */
#define TC1_OCIE1A_CLEAR_gc (0x00) /* Timer/Counter1 Output Compare Interrupt Enable - CLEAR */
#define TC1_OCIE1A_SET_gc   (0x02) /* Timer/Counter1 Output Compare Interrupt Enable - SET */


/* Timer/Counter1 Overflow Interrupt Enable */
#define TC1_TOIE1_CLEAR_gc (0x00) /* Timer/Counter1 Overflow Interrupt Enable - CLEAR */
#define TC1_TOIE1_SET_gc   (0x01) /* Timer/Counter1 Overflow Interrupt Enable - SET */


/* Timer/Counter1 Output Compare Flag A */
#define TC1_OCF1A_CLEAR_gc (0x00) /* Timer/Counter1 Output Compare Flag A - CLEAR */
#define TC1_OCF1A_SET_gc   (0x02) /* Timer/Counter1 Output Compare Flag A - SET */


/* Timer/Counter1 Overflow Flag */
#define TC1_TOV1_CLEAR_gc (0x00) /* Timer/Counter1 Overflow Flag - CLEAR */
#define TC1_TOV1_SET_gc   (0x01) /* Timer/Counter1 Overflow Flag - SET */


