stevenj/avr-libc3/include/avr/io/atmega406.h
/* Timer/Counter Synchronization Mode */
#define TC1_TSM_CLEAR_gc (0x00) /* Timer/Counter Synchronization Mode - CLEAR */
#define TC1_TSM_SET_gc   (0x80) /* Timer/Counter Synchronization Mode - SET */


/* Prescaler Reset */
#define TC1_PSRSYNC_CLEAR_gc (0x00) /* Prescaler Reset - CLEAR */
#define TC1_PSRSYNC_SET_gc   (0x01) /* Prescaler Reset - SET */


/*
--------------------------------------------------------------------------------
WAKEUP_TIMER - Wakeup Timer
--------------------------------------------------------------------------------
*/


/* Wake-up Timer Interrupt Flag */
#define WAKEUP_TIMER_WUTIF_CLEAR_gc (0x00) /* Wake-up Timer Interrupt Flag - CLEAR */
#define WAKEUP_TIMER_WUTIF_SET_gc   (0x80) /* Wake-up Timer Interrupt Flag - SET */


/* Wake-up Timer Interrupt Enable */
#define WAKEUP_TIMER_WUTIE_CLEAR_gc (0x00) /* Wake-up Timer Interrupt Enable - CLEAR */
#define WAKEUP_TIMER_WUTIE_SET_gc   (0x40) /* Wake-up Timer Interrupt Enable - SET */


/* Wake-up timer Calibration Flag */
#define WAKEUP_TIMER_WUTCF_CLEAR_gc (0x00) /* Wake-up timer Calibration Flag - CLEAR */
#define WAKEUP_TIMER_WUTCF_SET_gc   (0x20) /* Wake-up timer Calibration Flag - SET */


/* Wake-up Timer Reset */
#define WAKEUP_TIMER_WUTR_CLEAR_gc (0x00) /* Wake-up Timer Reset - CLEAR */
#define WAKEUP_TIMER_WUTR_SET_gc   (0x10) /* Wake-up Timer Reset - SET */


/* Wake-up Timer Enable */
#define WAKEUP_TIMER_WUTE_CLEAR_gc (0x00) /* Wake-up Timer Enable - CLEAR */
#define WAKEUP_TIMER_WUTE_SET_gc   (0x08) /* Wake-up Timer Enable - SET */


/* Wake-up Timer Prescaler Bits */
#define WAKEUP_TIMER_WUTP_VAL_0x00_gc (0x00) /* 4K(Slow RC) / 1K (32kHz) */
#define WAKEUP_TIMER_WUTP_VAL_0x01_gc (0x01) /* 8K(Slow RC) / 2K (32kHz) */
#define WAKEUP_TIMER_WUTP_VAL_0x02_gc (0x02) /* 16K(Slow RC) / 4K (32kHz) */
#define WAKEUP_TIMER_WUTP_VAL_0x03_gc (0x03) /* 32K(Slow RC) / 8K (32kHz) */
#define WAKEUP_TIMER_WUTP_VAL_0x04_gc (0x04) /* 64K(Slow RC) / 16K (32kHz) */
#define WAKEUP_TIMER_WUTP_VAL_0x05_gc (0x05) /* 128K(Slow RC) / 32K (32kHz) */
#define WAKEUP_TIMER_WUTP_VAL_0x06_gc (0x06) /* 256K(Slow RC) / 64K (32kHz) */
#define WAKEUP_TIMER_WUTP_VAL_0x07_gc (0x07) /* 512K(Slow RC) / 128K (32kHz) */


/*
--------------------------------------------------------------------------------
BATTERY_PROTECTION - Battery Protection
--------------------------------------------------------------------------------
*/


/* Battery Protection Parameter Lock Enable */
#define BATTERY_PROTECTION_BPPLE_CLEAR_gc (0x00) /* Battery Protection Parameter Lock Enable - CLEAR */
#define BATTERY_PROTECTION_BPPLE_SET_gc   (0x02) /* Battery Protection Parameter Lock Enable - SET */


/* Battery Protection Parameter Lock */
#define BATTERY_PROTECTION_BPPL_CLEAR_gc (0x00) /* Battery Protection Parameter Lock - CLEAR */
#define BATTERY_PROTECTION_BPPL_SET_gc   (0x01) /* Battery Protection Parameter Lock - SET */


/* Battery Protection Control Register-DUVD */
#define BATTERY_PROTECTION_DUVD_CLEAR_gc (0x00) /* Battery Protection Control Register-DUVD - CLEAR */
#define BATTERY_PROTECTION_DUVD_SET_gc   (0x08) /* Battery Protection Control Register-DUVD - SET */


/* Battery Protection Control Register-SCD */
#define BATTERY_PROTECTION_SCD_CLEAR_gc (0x00) /* Battery Protection Control Register-SCD - CLEAR */
#define BATTERY_PROTECTION_SCD_SET_gc   (0x04) /* Battery Protection Control Register-SCD - SET */


/* Battery Protection Control Register-DCD */
#define BATTERY_PROTECTION_DCD_CLEAR_gc (0x00) /* Battery Protection Control Register-DCD - CLEAR */
#define BATTERY_PROTECTION_DCD_SET_gc   (0x02) /* Battery Protection Control Register-DCD - SET */


/* Battery Protection Control Register-CCD */
#define BATTERY_PROTECTION_CCD_CLEAR_gc (0x00) /* Battery Protection Control Register-CCD - CLEAR */
#define BATTERY_PROTECTION_CCD_SET_gc   (0x01) /* Battery Protection Control Register-CCD - SET */


/* Current Battery Protection Timing Register-SCPT */
#define BATTERY_PROTECTION_SCPT_VAL_0x00_gc (0x00<<4) /* 61 us */
#define BATTERY_PROTECTION_SCPT_VAL_0x01_gc (0x01<<4) /* 122 us */
#define BATTERY_PROTECTION_SCPT_VAL_0x02_gc (0x02<<4) /* 183 us */
#define BATTERY_PROTECTION_SCPT_VAL_0x03_gc (0x03<<4) /* 244 us */
#define BATTERY_PROTECTION_SCPT_VAL_0x04_gc (0x04<<4) /* 305 us */
#define BATTERY_PROTECTION_SCPT_VAL_0x05_gc (0x05<<4) /* 366 us */
#define BATTERY_PROTECTION_SCPT_VAL_0x06_gc (0x06<<4) /* 427 us */
#define BATTERY_PROTECTION_SCPT_VAL_0x07_gc (0x07<<4) /* 488 us */
#define BATTERY_PROTECTION_SCPT_VAL_0x08_gc (0x08<<4) /* 610 us */
#define BATTERY_PROTECTION_SCPT_VAL_0x09_gc (0x09<<4) /* 732 us */
#define BATTERY_PROTECTION_SCPT_VAL_0x0A_gc (0x0A<<4) /* 854 us */
#define BATTERY_PROTECTION_SCPT_VAL_0x0B_gc (0x0B<<4) /* 976 us */
#define BATTERY_PROTECTION_SCPT_VAL_0x0C_gc (0x0C<<4) /* 1098 us */
#define BATTERY_PROTECTION_SCPT_VAL_0x0D_gc (0x0D<<4) /* 1220 us */
#define BATTERY_PROTECTION_SCPT_VAL_0x0E_gc (0x0E<<4) /* 1342 us */
#define BATTERY_PROTECTION_SCPT_VAL_0x0F_gc (0x0F<<4) /* 1464 us */


/* Current Battery Protection Timing Register-OCPT */
#define BATTERY_PROTECTION_OCPT_VAL_0x00_gc (0x00) /* 1 ms */
#define BATTERY_PROTECTION_OCPT_VAL_0x01_gc (0x01) /* 2 ms */
#define BATTERY_PROTECTION_OCPT_VAL_0x02_gc (0x02) /* 4 ms */
#define BATTERY_PROTECTION_OCPT_VAL_0x03_gc (0x03) /* 6 ms */
#define BATTERY_PROTECTION_OCPT_VAL_0x04_gc (0x04) /* 8 ms */
#define BATTERY_PROTECTION_OCPT_VAL_0x05_gc (0x05) /* 10 ms */
#define BATTERY_PROTECTION_OCPT_VAL_0x06_gc (0x06) /* 12 ms */
#define BATTERY_PROTECTION_OCPT_VAL_0x07_gc (0x07) /* 14 ms */
#define BATTERY_PROTECTION_OCPT_VAL_0x08_gc (0x08) /* 16 ms */
#define BATTERY_PROTECTION_OCPT_VAL_0x09_gc (0x09) /* 18 ms */
#define BATTERY_PROTECTION_OCPT_VAL_0x0A_gc (0x0A) /* 20 ms */
#define BATTERY_PROTECTION_OCPT_VAL_0x0B_gc (0x0B) /* 22 ms */
#define BATTERY_PROTECTION_OCPT_VAL_0x0C_gc (0x0C) /* 24 ms */
#define BATTERY_PROTECTION_OCPT_VAL_0x0D_gc (0x0D) /* 26 ms */
#define BATTERY_PROTECTION_OCPT_VAL_0x0E_gc (0x0E) /* 28 ms */
#define BATTERY_PROTECTION_OCPT_VAL_0x0F_gc (0x0F) /* 30 ms */


/* Battery Protection OverCurrent Detection Level Register-DCDL */
#define BATTERY_PROTECTION_DCDL_VAL_0x00_gc (0x00<<4) /* 0.050V */
#define BATTERY_PROTECTION_DCDL_VAL_0x01_gc (0x01<<4) /* 0.055V */
#define BATTERY_PROTECTION_DCDL_VAL_0x02_gc (0x02<<4) /* 0.060V */
#define BATTERY_PROTECTION_DCDL_VAL_0x03_gc (0x03<<4) /* 0.065V */
#define BATTERY_PROTECTION_DCDL_VAL_0x04_gc (0x04<<4) /* 0.070V */
#define BATTERY_PROTECTION_DCDL_VAL_0x05_gc (0x05<<4) /* 0.080V */
#define BATTERY_PROTECTION_DCDL_VAL_0x06_gc (0x06<<4) /* 0.090V */
#define BATTERY_PROTECTION_DCDL_VAL_0x07_gc (0x07<<4) /* 0.100V */
#define BATTERY_PROTECTION_DCDL_VAL_0x08_gc (0x08<<4) /* 0.110V */
#define BATTERY_PROTECTION_DCDL_VAL_0x09_gc (0x09<<4) /* 0.120V */
#define BATTERY_PROTECTION_DCDL_VAL_0x0A_gc (0x0A<<4) /* 0.130V */
#define BATTERY_PROTECTION_DCDL_VAL_0x0B_gc (0x0B<<4) /* 0.140V */
#define BATTERY_PROTECTION_DCDL_VAL_0x0C_gc (0x0C<<4) /* 0.160V */
#define BATTERY_PROTECTION_DCDL_VAL_0x0D_gc (0x0D<<4) /* 0.180V */
#define BATTERY_PROTECTION_DCDL_VAL_0x0E_gc (0x0E<<4) /* 0.200V */
#define BATTERY_PROTECTION_DCDL_VAL_0x0F_gc (0x0F<<4) /* 0.220V */


/* Battery Protection OverCurrent Detection Level Register-CCDL */
#define BATTERY_PROTECTION_CCDL_VAL_0x00_gc (0x00) /* 0.050V */
#define BATTERY_PROTECTION_CCDL_VAL_0x01_gc (0x01) /* 0.055V */
#define BATTERY_PROTECTION_CCDL_VAL_0x02_gc (0x02) /* 0.060V */
#define BATTERY_PROTECTION_CCDL_VAL_0x03_gc (0x03) /* 0.065V */
#define BATTERY_PROTECTION_CCDL_VAL_0x04_gc (0x04) /* 0.070V */
#define BATTERY_PROTECTION_CCDL_VAL_0x05_gc (0x05) /* 0.080V */
#define BATTERY_PROTECTION_CCDL_VAL_0x06_gc (0x06) /* 0.090V */
#define BATTERY_PROTECTION_CCDL_VAL_0x07_gc (0x07) /* 0.100V */
#define BATTERY_PROTECTION_CCDL_VAL_0x08_gc (0x08) /* 0.110V */
#define BATTERY_PROTECTION_CCDL_VAL_0x09_gc (0x09) /* 0.120V */
#define BATTERY_PROTECTION_CCDL_VAL_0x0A_gc (0x0A) /* 0.130V */
#define BATTERY_PROTECTION_CCDL_VAL_0x0B_gc (0x0B) /* 0.140V */
#define BATTERY_PROTECTION_CCDL_VAL_0x0C_gc (0x0C) /* 0.160V */
#define BATTERY_PROTECTION_CCDL_VAL_0x0D_gc (0x0D) /* 0.180V */
#define BATTERY_PROTECTION_CCDL_VAL_0x0E_gc (0x0E) /* 0.200V */
#define BATTERY_PROTECTION_CCDL_VAL_0x0F_gc (0x0F) /* 0.220V */


/* Battery Protection Short-Circuit Detection Level Register-SCDL */
#define BATTERY_PROTECTION_SCDL_VAL_0x00_gc (0x00) /* 0.100V */
#define BATTERY_PROTECTION_SCDL_VAL_0x01_gc (0x01) /* 0.110V */
#define BATTERY_PROTECTION_SCDL_VAL_0x02_gc (0x02) /* 0.120V */
#define BATTERY_PROTECTION_SCDL_VAL_0x03_gc (0x03) /* 0.130V */
#define BATTERY_PROTECTION_SCDL_VAL_0x04_gc (0x04) /* 0.140V */
#define BATTERY_PROTECTION_SCDL_VAL_0x05_gc (0x05) /* 0.160V */
#define BATTERY_PROTECTION_SCDL_VAL_0x06_gc (0x06) /* 0.180V */
#define BATTERY_PROTECTION_SCDL_VAL_0x07_gc (0x07) /* 0.200V */
#define BATTERY_PROTECTION_SCDL_VAL_0x08_gc (0x08) /* 0.220V */
#define BATTERY_PROTECTION_SCDL_VAL_0x09_gc (0x09) /* 0.240V */
#define BATTERY_PROTECTION_SCDL_VAL_0x0A_gc (0x0A) /* 0.260V */
#define BATTERY_PROTECTION_SCDL_VAL_0x0B_gc (0x0B) /* 0.280V */
#define BATTERY_PROTECTION_SCDL_VAL_0x0C_gc (0x0C) /* 0.320V */
#define BATTERY_PROTECTION_SCDL_VAL_0x0D_gc (0x0D) /* 0.360V */
#define BATTERY_PROTECTION_SCDL_VAL_0x0E_gc (0x0E) /* 0.400V */
#define BATTERY_PROTECTION_SCDL_VAL_0x0F_gc (0x0F) /* 0.440V */


/* Battery Protection Deep Under Voltage Register-DUVT */
#define BATTERY_PROTECTION_DUVT_VAL_0x00_gc (0x00<<4) /* 750ms */
#define BATTERY_PROTECTION_DUVT_VAL_0x01_gc (0x01<<4) /* 1000ms */
#define BATTERY_PROTECTION_DUVT_VAL_0x02_gc (0x02<<4) /* 1250ms */
#define BATTERY_PROTECTION_DUVT_VAL_0x03_gc (0x03<<4) /* 1500ms */


/* Battery Protection Deep Under Voltage Register-DUDL */
#define BATTERY_PROTECTION_DUDL_VAL_0x00_gc (0x00) /* 4.71V */
#define BATTERY_PROTECTION_DUDL_VAL_0x01_gc (0x01) /* 5.03V */
#define BATTERY_PROTECTION_DUDL_VAL_0x02_gc (0x02) /* 5.34V */
#define BATTERY_PROTECTION_DUDL_VAL_0x03_gc (0x03) /* 5.66V */
#define BATTERY_PROTECTION_DUDL_VAL_0x04_gc (0x04) /* 5.97V */
#define BATTERY_PROTECTION_DUDL_VAL_0x05_gc (0x05) /* 6.29V */
#define BATTERY_PROTECTION_DUDL_VAL_0x06_gc (0x06) /* 6.60V */
#define BATTERY_PROTECTION_DUDL_VAL_0x07_gc (0x07) /* 6.91V */
#define BATTERY_PROTECTION_DUDL_VAL_0x08_gc (0x08) /* 7.23V */
#define BATTERY_PROTECTION_DUDL_VAL_0x09_gc (0x09) /* 7.54V */
#define BATTERY_PROTECTION_DUDL_VAL_0x0A_gc (0x0A) /* 7.86V */
#define BATTERY_PROTECTION_DUDL_VAL_0x0B_gc (0x0B) /* 8.17V */
#define BATTERY_PROTECTION_DUDL_VAL_0x0C_gc (0x0C) /* 8.49V */
#define BATTERY_PROTECTION_DUDL_VAL_0x0D_gc (0x0D) /* 8.80V */
#define BATTERY_PROTECTION_DUDL_VAL_0x0E_gc (0x0E) /* 9.11V */
#define BATTERY_PROTECTION_DUDL_VAL_0x0F_gc (0x0F) /* 9.43V */


/* Deep Under-voltage Early Warning Interrupt Flag */
#define BATTERY_PROTECTION_DUVIF_CLEAR_gc (0x00) /* Deep Under-voltage Early Warning Interrupt Flag - CLEAR */
#define BATTERY_PROTECTION_DUVIF_SET_gc   (0x80) /* Deep Under-voltage Early Warning Interrupt Flag - SET */


/* Charge Over-current Protection Activated Interrupt Flag */
#define BATTERY_PROTECTION_COCIF_CLEAR_gc (0x00) /* Charge Over-current Protection Activated Interrupt Flag - CLEAR */
#define BATTERY_PROTECTION_COCIF_SET_gc   (0x40) /* Charge Over-current Protection Activated Interrupt Flag - SET */


/* Battery Protection Interrupt Register-DOCIF */
#define BATTERY_PROTECTION_DOCIF_CLEAR_gc (0x00) /* Battery Protection Interrupt Register-DOCIF - CLEAR */
#define BATTERY_PROTECTION_DOCIF_SET_gc   (0x20) /* Battery Protection Interrupt Register-DOCIF - SET */


