stevenj/avr-libc3/include/avr/io/atmega406.h
/* Battery Protection Interrupt Register-SCIF */
#define BATTERY_PROTECTION_SCIF_CLEAR_gc (0x00) /* Battery Protection Interrupt Register-SCIF - CLEAR */
#define BATTERY_PROTECTION_SCIF_SET_gc   (0x10) /* Battery Protection Interrupt Register-SCIF - SET */


/* Deep Under-voltage Early Warning Interrupt Enable */
#define BATTERY_PROTECTION_DUVIE_CLEAR_gc (0x00) /* Deep Under-voltage Early Warning Interrupt Enable - CLEAR */
#define BATTERY_PROTECTION_DUVIE_SET_gc   (0x08) /* Deep Under-voltage Early Warning Interrupt Enable - SET */


/* Battery Protection Interrupt Register-COCIE */
#define BATTERY_PROTECTION_COCIE_CLEAR_gc (0x00) /* Battery Protection Interrupt Register-COCIE - CLEAR */
#define BATTERY_PROTECTION_COCIE_SET_gc   (0x04) /* Battery Protection Interrupt Register-COCIE - SET */


/* Battery Protection Interrupt Register-DOCIE */
#define BATTERY_PROTECTION_DOCIE_CLEAR_gc (0x00) /* Battery Protection Interrupt Register-DOCIE - CLEAR */
#define BATTERY_PROTECTION_DOCIE_SET_gc   (0x02) /* Battery Protection Interrupt Register-DOCIE - SET */


/* Battery Protection Interrupt Register-SCIE */
#define BATTERY_PROTECTION_SCIE_CLEAR_gc (0x00) /* Battery Protection Interrupt Register-SCIE - CLEAR */
#define BATTERY_PROTECTION_SCIE_SET_gc   (0x01) /* Battery Protection Interrupt Register-SCIE - SET */


/*
--------------------------------------------------------------------------------
FET - FET Control
--------------------------------------------------------------------------------
*/


/* Pulse Width Modulation of OC output */
#define FET_PWMOC_CLEAR_gc (0x00) /* Pulse Width Modulation of OC output - CLEAR */
#define FET_PWMOC_SET_gc   (0x20) /* Pulse Width Modulation of OC output - SET */


/* Pulse Width Modulation Modulation of OPC output */
#define FET_PWMOPC_CLEAR_gc (0x00) /* Pulse Width Modulation Modulation of OPC output - CLEAR */
#define FET_PWMOPC_SET_gc   (0x10) /* Pulse Width Modulation Modulation of OPC output - SET */


/* Current Protection Status */
#define FET_CPS_CLEAR_gc (0x00) /* Current Protection Status - CLEAR */
#define FET_CPS_SET_gc   (0x08) /* Current Protection Status - SET */


/* Discharge FET Enable */
#define FET_DFE_CLEAR_gc (0x00) /* Discharge FET Enable - CLEAR */
#define FET_DFE_SET_gc   (0x04) /* Discharge FET Enable - SET */


/* Charge FET Enable */
#define FET_CFE_CLEAR_gc (0x00) /* Charge FET Enable - CLEAR */
#define FET_CFE_SET_gc   (0x02) /* Charge FET Enable - SET */


/* Precharge FET disable */
#define FET_PFD_CLEAR_gc (0x00) /* Precharge FET disable - CLEAR */
#define FET_PFD_SET_gc   (0x01) /* Precharge FET disable - SET */


/*
--------------------------------------------------------------------------------
COULOMB_COUNTER - Coulomb Counter
--------------------------------------------------------------------------------
*/


/* When the CADEN bit is cleared (zero), the CC-ADC is disabled. When the CADEN bit is set (one), the CC-ADC will continuously measure the voltage drop over the external sense resistor RSENSE. In Power-down, only the Regular Current detection is active. In Power-off, the CC-ADC is always disabled. */
#define COULOMB_COUNTER_CADEN_CLEAR_gc (0x00) /* When the CADEN bit is cleared (zero), the CC-ADC is disabled. When the CADEN bit is set (one), the CC-ADC will continuously measure the voltage drop over the external sense resistor RSENSE. In Power-down, only the Regular Current detection is active. In Power-off, the CC-ADC is always disabled. - CLEAR */
#define COULOMB_COUNTER_CADEN_SET_gc   (0x80) /* When the CADEN bit is cleared (zero), the CC-ADC is disabled. When the CADEN bit is set (one), the CC-ADC will continuously measure the voltage drop over the external sense resistor RSENSE. In Power-down, only the Regular Current detection is active. In Power-off, the CC-ADC is always disabled. - SET */


/* CC_ADC Update Busy */
#define COULOMB_COUNTER_CADUB_CLEAR_gc (0x00) /* CC_ADC Update Busy - CLEAR */
#define COULOMB_COUNTER_CADUB_SET_gc   (0x20) /* CC_ADC Update Busy - SET */


/* CC_ADC Accumulate Current Select Bits */
#define COULOMB_COUNTER_CADAS_VAL_0x00_gc (0x00<<3) /* 125ms */
#define COULOMB_COUNTER_CADAS_VAL_0x01_gc (0x01<<3) /* 250ms */
#define COULOMB_COUNTER_CADAS_VAL_0x02_gc (0x02<<3) /* 500ms */
#define COULOMB_COUNTER_CADAS_VAL_0x03_gc (0x03<<3) /* 1000ms */


/* The CADSI bits determine the current sampling interval for the Regular Current detection in Power-down mode. The actual settings remain to be determined. */
#define COULOMB_COUNTER_CADSI_VAL_0x00_gc (0x00<<1) /* 125ms */
#define COULOMB_COUNTER_CADSI_VAL_0x01_gc (0x01<<1) /* 250ms */
#define COULOMB_COUNTER_CADSI_VAL_0x02_gc (0x02<<1) /* 500ms */
#define COULOMB_COUNTER_CADSI_VAL_0x03_gc (0x03<<1) /* 1000ms */


/* When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode. */
#define COULOMB_COUNTER_CADSE_CLEAR_gc (0x00) /* When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode. - CLEAR */
#define COULOMB_COUNTER_CADSE_SET_gc   (0x01) /* When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode. - SET */


/* CC-ADC Control and Status Register B-CADACIE */
#define COULOMB_COUNTER_CADACIE_CLEAR_gc (0x00) /* CC-ADC Control and Status Register B-CADACIE - CLEAR */
#define COULOMB_COUNTER_CADACIE_SET_gc   (0x40) /* CC-ADC Control and Status Register B-CADACIE - SET */


/* Regular Current Interrupt Enable */
#define COULOMB_COUNTER_CADRCIE_CLEAR_gc (0x00) /* Regular Current Interrupt Enable - CLEAR */
#define COULOMB_COUNTER_CADRCIE_SET_gc   (0x20) /* Regular Current Interrupt Enable - SET */


/* CAD Instantenous Current Interrupt Enable */
#define COULOMB_COUNTER_CADICIE_CLEAR_gc (0x00) /* CAD Instantenous Current Interrupt Enable - CLEAR */
#define COULOMB_COUNTER_CADICIE_SET_gc   (0x10) /* CAD Instantenous Current Interrupt Enable - SET */


/* CC-ADC Accumulate Current Interrupt Flag */
#define COULOMB_COUNTER_CADACIF_CLEAR_gc (0x00) /* CC-ADC Accumulate Current Interrupt Flag - CLEAR */
#define COULOMB_COUNTER_CADACIF_SET_gc   (0x04) /* CC-ADC Accumulate Current Interrupt Flag - SET */


/* CC-ADC Accumulate Current Interrupt Flag */
#define COULOMB_COUNTER_CADRCIF_CLEAR_gc (0x00) /* CC-ADC Accumulate Current Interrupt Flag - CLEAR */
#define COULOMB_COUNTER_CADRCIF_SET_gc   (0x02) /* CC-ADC Accumulate Current Interrupt Flag - SET */


/* CC-ADC Instantaneous Current Interrupt Flag */
#define COULOMB_COUNTER_CADICIF_CLEAR_gc (0x00) /* CC-ADC Instantaneous Current Interrupt Flag - CLEAR */
#define COULOMB_COUNTER_CADICIF_SET_gc   (0x01) /* CC-ADC Instantaneous Current Interrupt Flag - SET */


