stevenj/avr-libc3/include/avr/io/atmega406.h
/* Watch Dog Enable */
#define WDT_WDE_CLEAR_gc (0x00) /* Watch Dog Enable - CLEAR */
#define WDT_WDE_SET_gc   (0x08) /* Watch Dog Enable - SET */


/*
--------------------------------------------------------------------------------
TC8 - Timer/Counter, 8-bit
--------------------------------------------------------------------------------
*/


/* Force Output Compare */
#define TC0_TCCR0A_COM0A_gc(x) ((x<<6) & 0xC0)

/* Timer/Counter0 Control Register-COM0B */
#define TC0_TCCR0A_COM0B_gc(x) ((x<<4) & 0x30)

/* Clock Select0 bits */
#define TC0_TCCR0A_WGM0_gc(x) (x & 0x03)

/* Force Output Compare */
#define TC0_FOC0A_CLEAR_gc (0x00) /* Force Output Compare - CLEAR */
#define TC0_FOC0A_SET_gc   (0x80) /* Force Output Compare - SET */


/* Waveform Generation Mode */
#define TC0_FOC0B_CLEAR_gc (0x00) /* Waveform Generation Mode - CLEAR */
#define TC0_FOC0B_SET_gc   (0x40) /* Waveform Generation Mode - SET */


/* Timer/Counter0 Control Register-WGM02 */
#define TC0_WGM02_CLEAR_gc (0x00) /* Timer/Counter0 Control Register-WGM02 - CLEAR */
#define TC0_WGM02_SET_gc   (0x08) /* Timer/Counter0 Control Register-WGM02 - SET */


/* Clock Select0 bits */
#define TC0_CS0_VAL_0x00_gc (0x00) /* No Clock Source (Stopped) */
#define TC0_CS0_VAL_0x01_gc (0x01) /* Running, No Prescaling */
#define TC0_CS0_VAL_0x02_gc (0x02) /* Running, CLK/8 */
#define TC0_CS0_VAL_0x03_gc (0x03) /* Running, CLK/64 */
#define TC0_CS0_VAL_0x04_gc (0x04) /* Running, CLK/256 */
#define TC0_CS0_VAL_0x05_gc (0x05) /* Running, CLK/1024 */
#define TC0_CS0_VAL_0x06_gc (0x06) /* Running, ExtClk Tx Falling Edge */
#define TC0_CS0_VAL_0x07_gc (0x07) /* Running, ExtClk Tx Rising Edge */


/* Output Compare Interrupt Enable */
#define TC0_OCIE0B_CLEAR_gc (0x00) /* Output Compare Interrupt Enable - CLEAR */
#define TC0_OCIE0B_SET_gc   (0x04) /* Output Compare Interrupt Enable - SET */


/* Output Compare Interrupt Enable */
#define TC0_OCIE0A_CLEAR_gc (0x00) /* Output Compare Interrupt Enable - CLEAR */
#define TC0_OCIE0A_SET_gc   (0x02) /* Output Compare Interrupt Enable - SET */


/* Overflow Interrupt Enable */
#define TC0_TOIE0_CLEAR_gc (0x00) /* Overflow Interrupt Enable - CLEAR */
#define TC0_TOIE0_SET_gc   (0x01) /* Overflow Interrupt Enable - SET */


/* Output Compare Flag */
#define TC0_OCF0B_CLEAR_gc (0x00) /* Output Compare Flag - CLEAR */
#define TC0_OCF0B_SET_gc   (0x04) /* Output Compare Flag - SET */


/* Output Compare Flag */
#define TC0_OCF0A_CLEAR_gc (0x00) /* Output Compare Flag - CLEAR */
#define TC0_OCF0A_SET_gc   (0x02) /* Output Compare Flag - SET */


/* Overflow Flag */
#define TC0_TOV0_CLEAR_gc (0x00) /* Overflow Flag - CLEAR */
#define TC0_TOV0_SET_gc   (0x01) /* Overflow Flag - SET */


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/


/*
--------------------------------------------------------------------------------
BOOT_LOAD - Bootloader
--------------------------------------------------------------------------------
*/


/* SPM Interrupt Enable */
#define BOOT_LOAD_SPMIE_CLEAR_gc (0x00) /* SPM Interrupt Enable - CLEAR */
#define BOOT_LOAD_SPMIE_SET_gc   (0x80) /* SPM Interrupt Enable - SET */


/* Read While Write Section Busy */
#define BOOT_LOAD_RWWSB_CLEAR_gc (0x00) /* Read While Write Section Busy - CLEAR */
#define BOOT_LOAD_RWWSB_SET_gc   (0x40) /* Read While Write Section Busy - SET */


/* Signature Row Read */
#define BOOT_LOAD_SIGRD_CLEAR_gc (0x00) /* Signature Row Read - CLEAR */
#define BOOT_LOAD_SIGRD_SET_gc   (0x20) /* Signature Row Read - SET */


/* Read While Write section read enable */
#define BOOT_LOAD_RWWSRE_CLEAR_gc (0x00) /* Read While Write section read enable - CLEAR */
#define BOOT_LOAD_RWWSRE_SET_gc   (0x10) /* Read While Write section read enable - SET */


/* Boot Lock Bit Set */
#define BOOT_LOAD_BLBSET_CLEAR_gc (0x00) /* Boot Lock Bit Set - CLEAR */
#define BOOT_LOAD_BLBSET_SET_gc   (0x08) /* Boot Lock Bit Set - SET */


/* Page Write */
#define BOOT_LOAD_PGWRT_CLEAR_gc (0x00) /* Page Write - CLEAR */
#define BOOT_LOAD_PGWRT_SET_gc   (0x04) /* Page Write - SET */


/* Page Erase */
#define BOOT_LOAD_PGERS_CLEAR_gc (0x00) /* Page Erase - CLEAR */
#define BOOT_LOAD_PGERS_SET_gc   (0x02) /* Page Erase - SET */


/* Store Program Memory Enable */
#define BOOT_LOAD_SPMEN_CLEAR_gc (0x00) /* Store Program Memory Enable - CLEAR */
#define BOOT_LOAD_SPMEN_SET_gc   (0x01) /* Store Program Memory Enable - SET */


/*
--------------------------------------------------------------------------------
TWI - Two Wire Serial Interface
--------------------------------------------------------------------------------
*/


/* TWI Bus Connect/Disconnect Interrupt Flag */
#define TWI_TWBCIF_CLEAR_gc (0x00) /* TWI Bus Connect/Disconnect Interrupt Flag - CLEAR */
#define TWI_TWBCIF_SET_gc   (0x80) /* TWI Bus Connect/Disconnect Interrupt Flag - SET */


/* TWI Bus Connect/Disconnect Interrupt Enable */
#define TWI_TWBCIE_CLEAR_gc (0x00) /* TWI Bus Connect/Disconnect Interrupt Enable - CLEAR */
#define TWI_TWBCIE_SET_gc   (0x40) /* TWI Bus Connect/Disconnect Interrupt Enable - SET */


/* TWI Bus Disconnect Time-out Period */
#define TWI_TWBDT_VAL_0x00_gc (0x00<<1) /* 250ms */
#define TWI_TWBDT_VAL_0x01_gc (0x01<<1) /* 500ms */
#define TWI_TWBDT_VAL_0x02_gc (0x02<<1) /* 1000ms */
#define TWI_TWBDT_VAL_0x03_gc (0x03<<1) /* 2000ms */


/* TWI Bus Connect/Disconnect Interrupt Polarity */
#define TWI_TWBCIP_CLEAR_gc (0x00) /* TWI Bus Connect/Disconnect Interrupt Polarity - CLEAR */
#define TWI_TWBCIP_SET_gc   (0x01) /* TWI Bus Connect/Disconnect Interrupt Polarity - SET */


