stevenj/avr-libc3/include/avr/io/atmega406.h
/* TWI Interrupt Flag */
#define TWI_TWINT_CLEAR_gc (0x00) /* TWI Interrupt Flag - CLEAR */
#define TWI_TWINT_SET_gc   (0x80) /* TWI Interrupt Flag - SET */


/* TWI Enable Acknowledge Bit */
#define TWI_TWEA_CLEAR_gc (0x00) /* TWI Enable Acknowledge Bit - CLEAR */
#define TWI_TWEA_SET_gc   (0x40) /* TWI Enable Acknowledge Bit - SET */


/* TWI Start Condition Bit */
#define TWI_TWSTA_CLEAR_gc (0x00) /* TWI Start Condition Bit - CLEAR */
#define TWI_TWSTA_SET_gc   (0x20) /* TWI Start Condition Bit - SET */


/* TWI Stop Condition Bit */
#define TWI_TWSTO_CLEAR_gc (0x00) /* TWI Stop Condition Bit - CLEAR */
#define TWI_TWSTO_SET_gc   (0x10) /* TWI Stop Condition Bit - SET */


/* TWI Write Collition Flag */
#define TWI_TWWC_CLEAR_gc (0x00) /* TWI Write Collition Flag - CLEAR */
#define TWI_TWWC_SET_gc   (0x08) /* TWI Write Collition Flag - SET */


/* TWI Enable Bit */
#define TWI_TWEN_CLEAR_gc (0x00) /* TWI Enable Bit - CLEAR */
#define TWI_TWEN_SET_gc   (0x04) /* TWI Enable Bit - SET */


/* TWI Interrupt Enable */
#define TWI_TWIE_CLEAR_gc (0x00) /* TWI Interrupt Enable - CLEAR */
#define TWI_TWIE_SET_gc   (0x01) /* TWI Interrupt Enable - SET */


/* TWI Status */
#define TWI_TWSR_TWS_gc(x) ((x<<3) & 0xF8)

/* TWI Prescaler */
#define TWI_TWPS_VAL_0x00_gc (0x00) /* 1 */
#define TWI_TWPS_VAL_0x01_gc (0x01) /* 4 */
#define TWI_TWPS_VAL_0x02_gc (0x02) /* 16 */
#define TWI_TWPS_VAL_0x03_gc (0x03) /* 64 */


/* TWI (Slave) Address register Bits */
#define TWI_TWAR_TWA_gc(x) ((x<<1) & 0xFE)

/* TWI General Call Recognition Enable Bit */
#define TWI_TWGCE_CLEAR_gc (0x00) /* TWI General Call Recognition Enable Bit - CLEAR */
#define TWI_TWGCE_SET_gc   (0x01) /* TWI General Call Recognition Enable Bit - SET */


/*
--------------------------------------------------------------------------------
BANDGAP - Bandgap
--------------------------------------------------------------------------------
*/


/* Setting the BGD bit to one will disable the bandgap voltage reference. This bit must be cleared before enabling CC-ADC or V-ADC, and must remain unset while either ADC is enabled. */
#define BANDGAP_BGD_CLEAR_gc (0x00) /* Setting the BGD bit to one will disable the bandgap voltage reference. This bit must be cleared before enabling CC-ADC or V-ADC, and must remain unset while either ADC is enabled. - CLEAR */
#define BANDGAP_BGD_SET_gc   (0x80) /* Setting the BGD bit to one will disable the bandgap voltage reference. This bit must be cleared before enabling CC-ADC or V-ADC, and must remain unset while either ADC is enabled. - SET */


/* BG Calibration of PTAT Current Bits */
#define BANDGAP_BGCCR_BGCC_gc(x) (x & 0x3F)

/*
--------------------------------------------------------------------------------
EEPROM - EEPROM
--------------------------------------------------------------------------------
*/


/* EEPROM Programming Mode Bits */
#define EEPROM_EEPM_VAL_0x00_gc (0x00<<4) /* Erase and Write in one operation */
#define EEPROM_EEPM_VAL_0x01_gc (0x01<<4) /* Erase Only */
#define EEPROM_EEPM_VAL_0x02_gc (0x02<<4) /* Write Only */


/* EEPROM Ready Interrupt Enable */
#define EEPROM_EERIE_CLEAR_gc (0x00) /* EEPROM Ready Interrupt Enable - CLEAR */
#define EEPROM_EERIE_SET_gc   (0x08) /* EEPROM Ready Interrupt Enable - SET */


/* EEPROM Master Programming Enable */
#define EEPROM_EEMPE_CLEAR_gc (0x00) /* EEPROM Master Programming Enable - CLEAR */
#define EEPROM_EEMPE_SET_gc   (0x04) /* EEPROM Master Programming Enable - SET */


/* EEPROM Programming Enable */
#define EEPROM_EEPE_CLEAR_gc (0x00) /* EEPROM Programming Enable - CLEAR */
#define EEPROM_EEPE_SET_gc   (0x02) /* EEPROM Programming Enable - SET */


/* EEPROM Read Enable */
#define EEPROM_EERE_CLEAR_gc (0x00) /* EEPROM Read Enable - CLEAR */
#define EEPROM_EERE_SET_gc   (0x01) /* EEPROM Read Enable - SET */

#endif

/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
C/ASM COMMON DEFINITIONS
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/

/*
================================================================================
Flattened fully qualified IO register names
================================================================================
*/


/* ADC - Analog-to-Digital Converter (0x0000) */
#define ADC_BASE                 _SFR_MEM16(0x0000) /* ADC Base Address */
#define ADC_VADC                 _SFR_MEM16(0x0078) /* VADC Data Register  Bytes */
#define ADC_VADCL                _SFR_MEM8 (0x0078) /* VADC Data Register  Bytes LOW BYTE */
#define ADC_VADCH                _SFR_MEM8 (0x0079) /* VADC Data Register  Bytes HIGH BYTE */
#define ADC_VADCSR               _SFR_MEM8 (0x007A) /* The VADC Control and Status register */
#define ADC_VADMUX               _SFR_MEM8 (0x007C) /* The VADC multiplexer Selection Register */

/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE               _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_PCIFR              _SFR_MEM8 (0x003B) /* Pin Change Interrupt Flag Register */
#define EXINT_EIFR               _SFR_MEM8 (0x003C) /* External Interrupt Flag Register */
#define EXINT_EIMSK              _SFR_MEM8 (0x003D) /* External Interrupt Mask Register */
#define EXINT_PCICR              _SFR_MEM8 (0x0068) /* Pin Change Interrupt Control Register */
#define EXINT_EICRA              _SFR_MEM8 (0x0069) /* External Interrupt Control Register */
#define EXINT_PCMSK0             _SFR_MEM8 (0x006B) /* Pin Change Enable Mask Register 0 */
#define EXINT_PCMSK1             _SFR_MEM8 (0x006C) /* Pin Change Enable Mask Register 1 */

/* TC1 - Timer/Counter, 16-bit (0x0000) */
#define TC16_BASE                _SFR_MEM8 (0x0000) /* TC16 Base Address */
#define TC16_TIFR1               _SFR_MEM8 (0x0036) /* Timer/Counter Interrupt Flag register */
#define TC16_GTCCR               _SFR_MEM8 (0x0043) /* General Timer/Counter Control Register */
#define TC16_TIMSK1              _SFR_MEM8 (0x006F) /* Timer/Counter Interrupt Mask Register */
#define TC16_TCCR1B              _SFR_MEM8 (0x0081) /* Timer/Counter1 Control Register B */
#define TC16_TCNT1               _SFR_MEM16(0x0084) /* Timer Counter 1  Bytes */
#define TC16_TCNT1L              _SFR_MEM8 (0x0084) /* Timer Counter 1  Bytes LOW BYTE */
#define TC16_TCNT1H              _SFR_MEM8 (0x0085) /* Timer Counter 1  Bytes HIGH BYTE */
#define TC16_OCR1AL              _SFR_MEM8 (0x0088) /* Output Compare Register 1A Low byte */
#define TC16_OCR1AH              _SFR_MEM8 (0x0089) /* Output Compare Register 1A High byte */

/* WAKEUP_TIMER - Wakeup Timer (0x0000) */
#define WAKEUP_TIMER_BASE        _SFR_MEM8 (0x0000) /* WAKEUP_TIMER Base Address */
#define WAKEUP_TIMER_WUTCSR      _SFR_MEM8 (0x0062) /* Wake-up Timer Control Register */

/* BATTERY_PROTECTION - Battery Protection (0x0000) */
#define BATTERY_PROTECTION_BASE  _SFR_MEM8 (0x0000) /* BATTERY_PROTECTION Base Address */
#define BATTERY_PROTECTION_BPIR  _SFR_MEM8 (0x00F2) /* Battery Protection Interrupt Register */
#define BATTERY_PROTECTION_BPDUV _SFR_MEM8 (0x00F3) /* Battery Protection Deep Under Voltage Register */
#define BATTERY_PROTECTION_BPSCD _SFR_MEM8 (0x00F4) /* Battery Protection Short-Circuit Detection Level Register */
#define BATTERY_PROTECTION_BPOCD _SFR_MEM8 (0x00F5) /* Battery Protection OverCurrent Detection Level Register */
#define BATTERY_PROTECTION_CBPTR _SFR_MEM8 (0x00F6) /* Current Battery Protection Timing Register */
#define BATTERY_PROTECTION_BPCR  _SFR_MEM8 (0x00F7) /* Battery Protection Control Register */
#define BATTERY_PROTECTION_BPPLR _SFR_MEM8 (0x00F8) /* Battery Protection Parameter Lock Register */

