stevenj/avr-libc3/include/avr/io/atmega406.h
/* FET - FET Control (0x0000) */
#define FET_BASE                 _SFR_MEM8 (0x0000) /* FET Base Address */
#define FET_FCSR                 _SFR_MEM8 (0x00F0) 

/* COULOMB_COUNTER - Coulomb Counter (0x0000) */
#define COULOMB_COUNTER_BASE     _SFR_MEM8 (0x0000) /* COULOMB_COUNTER Base Address */
#define COULOMB_COUNTER_CADAC0   _SFR_MEM8 (0x00E0) /* ADC Accumulate Current */
#define COULOMB_COUNTER_CADAC1   _SFR_MEM8 (0x00E1) /* ADC Accumulate Current */
#define COULOMB_COUNTER_CADAC2   _SFR_MEM8 (0x00E2) /* ADC Accumulate Current */
#define COULOMB_COUNTER_CADAC3   _SFR_MEM8 (0x00E3) /* ADC Accumulate Current */
#define COULOMB_COUNTER_CADCSRA  _SFR_MEM8 (0x00E4) /* CC-ADC Control and Status Register A */
#define COULOMB_COUNTER_CADCSRB  _SFR_MEM8 (0x00E5) /* CC-ADC Control and Status Register B */
#define COULOMB_COUNTER_CADRCC   _SFR_MEM8 (0x00E6) /* CC-ADC Regular Charge Current */
#define COULOMB_COUNTER_CADRDC   _SFR_MEM8 (0x00E7) /* CC-ADC Regular Discharge Current */
#define COULOMB_COUNTER_CADIC    _SFR_MEM16(0x00E8) /* CC-ADC Instantaneous Current */
#define COULOMB_COUNTER_CADICL   _SFR_MEM8 (0x00E8) /* CC-ADC Instantaneous Current LOW BYTE */
#define COULOMB_COUNTER_CADICH   _SFR_MEM8 (0x00E9) /* CC-ADC Instantaneous Current HIGH BYTE */

/* CELL_BALANCING - Cell Balancing (0x0000) */
#define CELL_BALANCING_BASE      _SFR_MEM8 (0x0000) /* CELL_BALANCING Base Address */
#define CELL_BALANCING_CBCR      _SFR_MEM8 (0x00F1) /* Cell Balancing Control Register */

/* CPU - CPU Registers (0x0000) */
#define CPU_BASE                 _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_GPIOR0               _SFR_MEM8 (0x003E) /* General Purpose IO Register 0 */
#define CPU_GPIOR1               _SFR_MEM8 (0x004A) /* General Purpose IO Register 1 */
#define CPU_GPIOR2               _SFR_MEM8 (0x004B) /* General Purpose IO Register 2 */
#define CPU_SMCR                 _SFR_MEM8 (0x0053) /* Sleep Mode Control Register */
#define CPU_MCUSR                _SFR_MEM8 (0x0054) /* MCU Status Register */
#define CPU_MCUCR                _SFR_MEM8 (0x0055) /* MCU Control Register */
#define CPU_SP                   _SFR_MEM16(0x005D) /* Stack Pointer  */
#define CPU_SPL                  _SFR_MEM8 (0x005D) /* Stack Pointer  LOW BYTE */
#define CPU_SPH                  _SFR_MEM8 (0x005E) /* Stack Pointer  HIGH BYTE */
#define CPU_SREG                 _SFR_MEM8 (0x005F) /* Status Register */
#define CPU_PRR0                 _SFR_MEM8 (0x0064) /* Power Reduction Register 0 */
#define CPU_FOSCCAL              _SFR_MEM8 (0x0066) /* Fast Oscillator Calibration Value */
#define CPU_DIDR0                _SFR_MEM8 (0x007E) /* Digital Input Disable Register */
#define CPU_CCSR                 _SFR_MEM8 (0x00C0) /* Clock Control and Status Register */

/* WDT - Watchdog Timer (0x0000) */
#define WDT_BASE                 _SFR_MEM8 (0x0000) /* WDT Base Address */
#define WDT_WDTCSR               _SFR_MEM8 (0x0060) /* Watchdog Timer Control Register */

/* TC0 - Timer/Counter, 8-bit (0x0000) */
#define TC8_BASE                 _SFR_MEM8 (0x0000) /* TC8 Base Address */
#define TC8_TIFR0                _SFR_MEM8 (0x0035) /* Timer/Counter Interrupt Flag register */
#define TC8_TCCR0A               _SFR_MEM8 (0x0044) /* Timer/Counter0 Control Register */
#define TC8_TCCR0B               _SFR_MEM8 (0x0045) /* Timer/Counter0 Control Register */
#define TC8_TCNT0                _SFR_MEM8 (0x0046) /* Timer Counter 0 */
#define TC8_OCR0A                _SFR_MEM8 (0x0047) /* Output compare Register A */
#define TC8_OCR0B                _SFR_MEM8 (0x0048) /* Output compare Register B */
#define TC8_TIMSK0               _SFR_MEM8 (0x006E) /* Timer/Counter Interrupt Mask Register */

/* PORTA - I/O Port (0x0000) */
#define PORTAA_BASE              _SFR_MEM8 (0x0000) /* PORTAA Base Address */
#define PORTAA_PINA              _SFR_MEM8 (0x0020) /* Port A Input Pins */
#define PORTAA_DDRA              _SFR_MEM8 (0x0021) /* Port A Data Direction Register */
#define PORTAA_PORTA             _SFR_MEM8 (0x0022) /* Port A Data Register */

/* PORTB - I/O Port (0x0000) */
#define PORTBB_BASE              _SFR_MEM8 (0x0000) /* PORTBB Base Address */
#define PORTBB_PINB              _SFR_MEM8 (0x0023) /* Port B Input Pins */
#define PORTBB_DDRB              _SFR_MEM8 (0x0024) /* Port B Data Direction Register */
#define PORTBB_PORTB             _SFR_MEM8 (0x0025) /* Port B Data Register */

/* PORTC - I/O Port (0x0000) */
#define PORTCC_BASE              _SFR_MEM8 (0x0000) /* PORTCC Base Address */
#define PORTCC_PORTC             _SFR_MEM8 (0x0028) /* Port C Data Register */

/* PORTD - I/O Port (0x0000) */
#define PORTDD_BASE              _SFR_MEM8 (0x0000) /* PORTDD Base Address */
#define PORTDD_PIND              _SFR_MEM8 (0x0029) /* Input Pins, Port D */
#define PORTDD_DDRD              _SFR_MEM8 (0x002A) /* Data Direction Register, Port D */
#define PORTDD_PORTD             _SFR_MEM8 (0x002B) /* Data Register, Port D */

/* BOOT_LOAD - Bootloader (0x0000) */
#define BOOT_LOAD_BASE           _SFR_MEM8 (0x0000) /* BOOT_LOAD Base Address */
#define BOOT_LOAD_SPMCSR         _SFR_MEM8 (0x0057) /* Store Program Memory Control Register */

/* TWI - Two Wire Serial Interface (0x0000) */
#define TWI_BASE                 _SFR_MEM8 (0x0000) /* TWI Base Address */
#define TWI_TWBR                 _SFR_MEM8 (0x00B8) /* TWI Bit Rate register */
#define TWI_TWSR                 _SFR_MEM8 (0x00B9) /* TWI Status Register */
#define TWI_TWAR                 _SFR_MEM8 (0x00BA) /* TWI (Slave) Address register */
#define TWI_TWDR                 _SFR_MEM8 (0x00BB) /* TWI Data register */
#define TWI_TWCR                 _SFR_MEM8 (0x00BC) /* TWI Control Register */
#define TWI_TWAMR                _SFR_MEM8 (0x00BD) /* TWI (Slave) Address Mask Register */
#define TWI_TWBCSR               _SFR_MEM8 (0x00BE) /* TWI Bus Control and Status Register */

/* BANDGAP - Bandgap (0x0000) */
#define BANDGAP_BASE             _SFR_MEM8 (0x0000) /* BANDGAP Base Address */
#define BANDGAP_BGCCR            _SFR_MEM8 (0x00D0) /* Bandgap Calibration Register */
#define BANDGAP_BGCRR            _SFR_MEM8 (0x00D1) /* Bandgap Calibration of Resistor Ladder */

/* EEPROM - EEPROM (0x0000) */
#define EEPROM_BASE              _SFR_MEM8 (0x0000) /* EEPROM Base Address */
#define EEPROM_EECR              _SFR_MEM8 (0x003F) /* EEPROM Control Register */
#define EEPROM_EEDR              _SFR_MEM8 (0x0040) /* EEPROM Data Register */
#define EEPROM_EEAR              _SFR_MEM16(0x0041) /* EEPROM Address Register  Bytes */
#define EEPROM_EEARL             _SFR_MEM8 (0x0041) /* EEPROM Address Register  Bytes LOW BYTE */
#define EEPROM_EEARH             _SFR_MEM8 (0x0042) /* EEPROM Address Register  Bytes HIGH BYTE */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE                _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_LOW                 _SFR_MEM8 (0x0000) 
#define FUSE_HIGH                _SFR_MEM8 (0x0001) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE             _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT          _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

