stevenj/avr-libc3/include/avr/io/atmega406.h
/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num         (0)                 
#define None_RESET_vect             _VECTOR(0)          /* External Pin, Power-on Reset, Brown-out Reset and Watchdog Reset */
#define None_BPINT_vect_num         (1)                 
#define None_BPINT_vect             _VECTOR(1)          /* Battery Protection Interrupt */
#define None_INT0_vect_num          (2)                 
#define None_INT0_vect              _VECTOR(2)          /* External Interrupt Request 0 */
#define None_INT1_vect_num          (3)                 
#define None_INT1_vect              _VECTOR(3)          /* External Interrupt Request 1 */
#define None_INT2_vect_num          (4)                 
#define None_INT2_vect              _VECTOR(4)          /* External Interrupt Request 2 */
#define None_INT3_vect_num          (5)                 
#define None_INT3_vect              _VECTOR(5)          /* External Interrupt Request 3 */
#define None_PCINT0_vect_num        (6)                 
#define None_PCINT0_vect            _VECTOR(6)          /* Pin Change Interrupt 0 */
#define None_PCINT1_vect_num        (7)                 
#define None_PCINT1_vect            _VECTOR(7)          /* Pin Change Interrupt 1 */
#define None_WDT_vect_num           (8)                 
#define None_WDT_vect               _VECTOR(8)          /* Watchdog Timeout Interrupt */
#define None_WAKE_UP_vect_num       (9)                 
#define None_WAKE_UP_vect           _VECTOR(9)          /* Wakeup timer overflow */
#define None_TIM1_COMP_vect_num     (10)                
#define None_TIM1_COMP_vect         _VECTOR(10)         /* Timer/Counter 1 Compare Match */
#define None_TIM1_OVF_vect_num      (11)                
#define None_TIM1_OVF_vect          _VECTOR(11)         /* Timer/Counter 1 Overflow */
#define None_TIM0_COMPA_vect_num    (12)                
#define None_TIM0_COMPA_vect        _VECTOR(12)         /* Timer/Counter0 Compare A Match */
#define None_TIM0_COMPB_vect_num    (13)                
#define None_TIM0_COMPB_vect        _VECTOR(13)         /* Timer/Counter0 Compare B Match */
#define None_TIM0_OVF_vect_num      (14)                
#define None_TIM0_OVF_vect          _VECTOR(14)         /* Timer/Counter0 Overflow */
#define None_TWI_BUS_CD_vect_num    (15)                
#define None_TWI_BUS_CD_vect        _VECTOR(15)         /* Two-Wire Bus Connect/Disconnect */
#define None_TWI_vect_num           (16)                
#define None_TWI_vect               _VECTOR(16)         /* Two-Wire Serial Interface */
#define None_VADC_vect_num          (17)                
#define None_VADC_vect              _VECTOR(17)         /* Voltage ADC Conversion Complete */
#define None_CCADC_CONV_vect_num    (18)                
#define None_CCADC_CONV_vect        _VECTOR(18)         /* Coulomb Counter ADC Conversion Complete */
#define None_CCADC_REG_CUR_vect_num (19)                
#define None_CCADC_REG_CUR_vect     _VECTOR(19)         /* Coloumb Counter ADC Regular Current */
#define None_CCADC_ACC_vect_num     (20)                
#define None_CCADC_ACC_vect         _VECTOR(20)         /* Coloumb Counter ADC Accumulator */
#define None_EE_READY_vect_num      (21)                
#define None_EE_READY_vect          _VECTOR(21)         /* EEPROM Ready */
#define None_SPM_READY_vect_num     (22)                
#define None_SPM_READY_vect         _VECTOR(22)         /* Store Program Memory Ready */

/* Vector Table Size */
#define _VECTOR_SIZE                (4)                 /* Size of individual vector. */
#define _VECTORS_SIZE               (23 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

#define PROGMEM_START            (0x0000)                                         
#define PROGMEM_SIZE             (0xA000)                                         
#define PROGMEM_END              (PROGMEM_START + PROGMEM_SIZE - 1)               

#define FLASH_START              (0x0000)                                         
#define FLASH_SIZE               (0xA000)                                         
#define FLASH_PAGE_SIZE          (0x0080)                                         
#define FLASH_END                (FLASH_START + FLASH_SIZE - 1)                   

#define BOOT_SECTION_1_START     (0x9E00)                                         
#define BOOT_SECTION_1_SIZE      (0x0200)                                         
#define BOOT_SECTION_1_PAGE_SIZE (0x0080)                                         
#define BOOT_SECTION_1_END       (BOOT_SECTION_1_START + BOOT_SECTION_1_SIZE - 1) 

#define BOOT_SECTION_2_START     (0x9C00)                                         
#define BOOT_SECTION_2_SIZE      (0x0400)                                         
#define BOOT_SECTION_2_PAGE_SIZE (0x0080)                                         
#define BOOT_SECTION_2_END       (BOOT_SECTION_2_START + BOOT_SECTION_2_SIZE - 1) 

#define BOOT_SECTION_3_START     (0x9800)                                         
#define BOOT_SECTION_3_SIZE      (0x0800)                                         
#define BOOT_SECTION_3_PAGE_SIZE (0x0080)                                         
#define BOOT_SECTION_3_END       (BOOT_SECTION_3_START + BOOT_SECTION_3_SIZE - 1) 

#define BOOT_SECTION_4_START     (0x9000)                                         
#define BOOT_SECTION_4_SIZE      (0x1000)                                         
#define BOOT_SECTION_4_PAGE_SIZE (0x0080)                                         
#define BOOT_SECTION_4_END       (BOOT_SECTION_4_START + BOOT_SECTION_4_SIZE - 1) 

#define SIGNATURESMEM_START  (0x0000)                                       
#define SIGNATURESMEM_SIZE   (0x0003)                                       
#define SIGNATURESMEM_END    (SIGNATURESMEM_START + SIGNATURESMEM_SIZE - 1) 

#define SIGNATURES_START     (0x0000)                                       
#define SIGNATURES_SIZE      (0x0003)                                       
#define SIGNATURES_PAGE_SIZE (0x0001)                                       
#define SIGNATURES_END       (SIGNATURES_START + SIGNATURES_SIZE - 1)       

#define FUSESMEM_START  (0x0000)                             
#define FUSESMEM_SIZE   (0x0002)                             
#define FUSESMEM_END    (FUSESMEM_START + FUSESMEM_SIZE - 1) 

